/* automatically generated by rust-bindgen 0.69.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const GPIO_LINE_OPEN_SOURCE: u32 = 0;
pub const GPIO_OPEN_DRAIN: u32 = 6;
pub const GPIO_OPEN_SOURCE: u32 = 2;
pub const GPIO_PULL_UP: u32 = 16;
pub const GPIO_PULL_DOWN: u32 = 32;
pub const GPIO_INPUT: u32 = 65536;
pub const GPIO_OUTPUT: u32 = 131072;
pub const GPIO_DISCONNECTED: u32 = 0;
pub const GPIO_OUTPUT_INIT_LOW: u32 = 262144;
pub const GPIO_OUTPUT_INIT_HIGH: u32 = 524288;
pub const GPIO_OUTPUT_INIT_LOGICAL: u32 = 1048576;
pub const GPIO_OUTPUT_LOW: u32 = 393216;
pub const GPIO_OUTPUT_HIGH: u32 = 655360;
pub const GPIO_OUTPUT_INACTIVE: u32 = 1441792;
pub const GPIO_OUTPUT_ACTIVE: u32 = 1703936;
pub const GPIO_INT_DISABLE: u32 = 2097152;
pub const GPIO_INT_ENABLE: u32 = 4194304;
pub const GPIO_INT_LEVELS_LOGICAL: u32 = 8388608;
pub const GPIO_INT_EDGE: u32 = 16777216;
pub const GPIO_INT_LOW_0: u32 = 33554432;
pub const GPIO_INT_HIGH_1: u32 = 67108864;
pub const GPIO_INT_MASK: u32 = 132120576;
pub const GPIO_INT_EDGE_RISING: u32 = 88080384;
pub const GPIO_INT_EDGE_FALLING: u32 = 54525952;
pub const GPIO_INT_EDGE_BOTH: u32 = 121634816;
pub const GPIO_INT_LEVEL_LOW: u32 = 37748736;
pub const GPIO_INT_LEVEL_HIGH: u32 = 71303168;
pub const GPIO_INT_EDGE_TO_INACTIVE: u32 = 62914560;
pub const GPIO_INT_EDGE_TO_ACTIVE: u32 = 96468992;
pub const GPIO_INT_LEVEL_INACTIVE: u32 = 46137344;
pub const GPIO_INT_LEVEL_ACTIVE: u32 = 79691776;
pub const GPIO_DIR_MASK: u32 = 196608;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = cty::c_uchar;
pub type __u_short = cty::c_ushort;
pub type __u_int = cty::c_uint;
pub type __u_long = cty::c_ulong;
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_long;
pub type __uint64_t = cty::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = cty::c_long;
pub type __u_quad_t = cty::c_ulong;
pub type __intmax_t = cty::c_long;
pub type __uintmax_t = cty::c_ulong;
pub type __dev_t = cty::c_ulong;
pub type __uid_t = cty::c_uint;
pub type __gid_t = cty::c_uint;
pub type __ino_t = cty::c_ulong;
pub type __ino64_t = cty::c_ulong;
pub type __mode_t = cty::c_uint;
pub type __nlink_t = cty::c_ulong;
pub type __off_t = cty::c_long;
pub type __off64_t = cty::c_long;
pub type __pid_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [cty::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = cty::c_long;
pub type __rlim_t = cty::c_ulong;
pub type __rlim64_t = cty::c_ulong;
pub type __id_t = cty::c_uint;
pub type __time_t = cty::c_long;
pub type __useconds_t = cty::c_uint;
pub type __suseconds_t = cty::c_long;
pub type __suseconds64_t = cty::c_long;
pub type __daddr_t = cty::c_int;
pub type __key_t = cty::c_int;
pub type __clockid_t = cty::c_int;
pub type __timer_t = *mut cty::c_void;
pub type __blksize_t = cty::c_long;
pub type __blkcnt_t = cty::c_long;
pub type __blkcnt64_t = cty::c_long;
pub type __fsblkcnt_t = cty::c_ulong;
pub type __fsblkcnt64_t = cty::c_ulong;
pub type __fsfilcnt_t = cty::c_ulong;
pub type __fsfilcnt64_t = cty::c_ulong;
pub type __fsword_t = cty::c_long;
pub type __ssize_t = cty::c_long;
pub type __syscall_slong_t = cty::c_long;
pub type __syscall_ulong_t = cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut cty::c_char;
pub type __intptr_t = cty::c_long;
pub type __socklen_t = cty::c_uint;
pub type __sig_atomic_t = cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: cty::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: cty::c_uint,
    pub __wchb: [cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos64_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = cty::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: cty::c_int,
    pub _IO_read_ptr: *mut cty::c_char,
    pub _IO_read_end: *mut cty::c_char,
    pub _IO_read_base: *mut cty::c_char,
    pub _IO_write_base: *mut cty::c_char,
    pub _IO_write_ptr: *mut cty::c_char,
    pub _IO_write_end: *mut cty::c_char,
    pub _IO_buf_base: *mut cty::c_char,
    pub _IO_buf_end: *mut cty::c_char,
    pub _IO_save_base: *mut cty::c_char,
    pub _IO_backup_base: *mut cty::c_char,
    pub _IO_save_end: *mut cty::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: cty::c_int,
    pub _flags2: cty::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: cty::c_ushort,
    pub _vtable_offset: cty::c_schar,
    pub _shortbuf: [cty::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut cty::c_void,
    pub __pad5: usize,
    pub _mode: cty::c_int,
    pub _unused2: [cty::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_FILE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn rename(__old: *const cty::c_char, __new: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: cty::c_int,
        __old: *const cty::c_char,
        __newfd: cty::c_int,
        __new: *const cty::c_char,
    ) -> cty::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const cty::c_char, __pfx: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const cty::c_char, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const cty::c_char,
        __modes: *const cty::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: cty::c_int, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut cty::c_void, __len: usize, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut cty::c_char, __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut cty::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut cty::c_char,
        __modes: cty::c_int,
        __n: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut cty::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn printf(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut cty::c_char,
        __maxlen: cty::c_ulong,
        __format: *const cty::c_char,
        ...
    ) -> cty::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut cty::c_char,
        __maxlen: cty::c_ulong,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: cty::c_int,
        __fmt: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn dprintf(__fd: cty::c_int, __fmt: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn scanf(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(__s: *const cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getchar() -> cty::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> cty::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fputc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putchar(__c: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putw(__w: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut cty::c_char, __n: cty::c_int, __stream: *mut FILE) -> *mut cty::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __delimiter: cty::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __delimiter: cty::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const cty::c_char, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn puts(__s: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn ungetc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut cty::c_void,
        __size: cty::c_ulong,
        __n: cty::c_ulong,
        __stream: *mut FILE,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const cty::c_void,
        __size: cty::c_ulong,
        __n: cty::c_ulong,
        __s: *mut FILE,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut cty::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const cty::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: cty::c_long, __whence: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> cty::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t, __whence: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn perror(__s: *const cty::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn popen(__command: *const cty::c_char, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: cty::c_int) -> cty::c_int;
}
pub type wchar_t = cty::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type int_fast16_t = cty::c_long;
pub type int_fast32_t = cty::c_long;
pub type int_fast64_t = cty::c_long;
pub type uint_fast8_t = cty::c_uchar;
pub type uint_fast16_t = cty::c_ulong;
pub type uint_fast32_t = cty::c_ulong;
pub type uint_fast64_t = cty::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union z_max_align_t {
    pub thelonglong: cty::c_longlong,
    pub thelongdouble: u128,
    pub theuintmax_t: uintmax_t,
    pub thesize_t: usize,
    pub theuintptr_t: usize,
    pub thepvoid: *mut cty::c_void,
    pub thepfunc: ::core::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_z_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<z_max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(z_max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<z_max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(z_max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thelonglong) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thelonglong)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thelongdouble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thelongdouble)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).theuintmax_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(theuintmax_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thesize_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thesize_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).theuintptr_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(theuintptr_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thepvoid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thepvoid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thepfunc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thepfunc)
        )
    );
}
pub type atomic_t = cty::c_long;
pub type atomic_val_t = atomic_t;
pub type atomic_ptr_t = *mut cty::c_void;
pub type atomic_ptr_val_t = atomic_ptr_t;
extern "C" {
    #[doc = " @brief Atomic compare-and-set.\n\n This routine performs an atomic compare-and-set on @a target. If the current\n value of @a target equals @a old_value, @a target is set to @a new_value.\n If the current value of @a target does not equal @a old_value, @a target\n is left unchanged.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param old_value Original value to compare against.\n @param new_value New value to store.\n @return true if @a new_value is written, false otherwise."]
    #[link_name = "atomic_cas__extern"]
    pub fn atomic_cas(
        target: *mut atomic_t,
        old_value: atomic_val_t,
        new_value: atomic_val_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Atomic compare-and-set with pointer values\n\n This routine performs an atomic compare-and-set on @a target. If the current\n value of @a target equals @a old_value, @a target is set to @a new_value.\n If the current value of @a target does not equal @a old_value, @a target\n is left unchanged.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param old_value Original value to compare against.\n @param new_value New value to store.\n @return true if @a new_value is written, false otherwise."]
    #[link_name = "atomic_ptr_cas__extern"]
    pub fn atomic_ptr_cas(
        target: *mut atomic_ptr_t,
        old_value: atomic_ptr_val_t,
        new_value: atomic_ptr_val_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Atomic addition.\n\n This routine performs an atomic addition on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to add.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_add__extern"]
    pub fn atomic_add(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic subtraction.\n\n This routine performs an atomic subtraction on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to subtract.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_sub__extern"]
    pub fn atomic_sub(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic increment.\n\n This routine performs an atomic increment by 1 on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_inc__extern"]
    pub fn atomic_inc(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic decrement.\n\n This routine performs an atomic decrement by 1 on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_dec__extern"]
    pub fn atomic_dec(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get.\n\n This routine performs an atomic read on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Value of @a target."]
    #[link_name = "atomic_get__extern"]
    pub fn atomic_get(target: *const atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get a pointer value\n\n This routine performs an atomic read on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of pointer variable.\n\n @return Value of @a target."]
    #[link_name = "atomic_ptr_get__extern"]
    pub fn atomic_ptr_get(target: *const atomic_ptr_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get-and-set.\n\n This routine atomically sets @a target to @a value and returns\n the previous value of @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to write to @a target.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_set__extern"]
    pub fn atomic_set(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get-and-set for pointer values\n\n This routine atomically sets @a target to @a value and returns\n the previous value of @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to write to @a target.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_ptr_set__extern"]
    pub fn atomic_ptr_set(target: *mut atomic_ptr_t, value: atomic_ptr_val_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic clear.\n\n This routine atomically sets @a target to zero and returns its previous\n value. (Hence, it is equivalent to atomic_set(target, 0).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_clear__extern"]
    pub fn atomic_clear(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic clear of a pointer value\n\n This routine atomically sets @a target to zero and returns its previous\n value. (Hence, it is equivalent to atomic_set(target, 0).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_ptr_clear__extern"]
    pub fn atomic_ptr_clear(target: *mut atomic_ptr_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise inclusive OR.\n\n This routine atomically sets @a target to the bitwise inclusive OR of\n @a target and @a value.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to OR.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_or__extern"]
    pub fn atomic_or(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise exclusive OR (XOR).\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n This routine atomically sets @a target to the bitwise exclusive OR (XOR) of\n @a target and @a value.\n\n @param target Address of atomic variable.\n @param value Value to XOR\n\n @return Previous value of @a target."]
    #[link_name = "atomic_xor__extern"]
    pub fn atomic_xor(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise AND.\n\n This routine atomically sets @a target to the bitwise AND of @a target\n and @a value.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to AND.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_and__extern"]
    pub fn atomic_and(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise NAND.\n\n This routine atomically sets @a target to the bitwise NAND of @a target\n and @a value. (This operation is equivalent to target = ~(target & value).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to NAND.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_nand__extern"]
    pub fn atomic_nand(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomically test a bit.\n\n This routine tests whether bit number @a bit of @a target is set or not.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return true if the bit was set, false if it wasn't."]
    #[link_name = "atomic_test_bit__extern"]
    pub fn atomic_test_bit(target: *const atomic_t, bit: cty::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically test and clear a bit.\n\n Atomically clear bit number @a bit of @a target and return its old value.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return false if the bit was already cleared, true if it wasn't."]
    #[link_name = "atomic_test_and_clear_bit__extern"]
    pub fn atomic_test_and_clear_bit(target: *mut atomic_t, bit: cty::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically set a bit.\n\n Atomically set bit number @a bit of @a target and return its old value.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return true if the bit was already set, false if it wasn't."]
    #[link_name = "atomic_test_and_set_bit__extern"]
    pub fn atomic_test_and_set_bit(target: *mut atomic_t, bit: cty::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically clear a bit.\n\n Atomically clear bit number @a bit of @a target.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0)."]
    #[link_name = "atomic_clear_bit__extern"]
    pub fn atomic_clear_bit(target: *mut atomic_t, bit: cty::c_int);
}
extern "C" {
    #[doc = " @brief Atomically set a bit.\n\n Atomically set bit number @a bit of @a target.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0)."]
    #[link_name = "atomic_set_bit__extern"]
    pub fn atomic_set_bit(target: *mut atomic_t, bit: cty::c_int);
}
extern "C" {
    #[doc = " @brief Atomically set a bit to a given value.\n\n Atomically set bit number @a bit of @a target to value @a val.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n @param val true for 1, false for 0."]
    #[link_name = "atomic_set_bit_to__extern"]
    pub fn atomic_set_bit_to(target: *mut atomic_t, bit: cty::c_int, val: bool);
}
extern "C" {
    pub fn assert_print(fmt: *const cty::c_char, ...);
}
extern "C" {
    #[doc = " @brief Is @p x a power of two?\n @param x value to check\n @return true if @p x is a power of two, false otherwise"]
    #[link_name = "is_power_of_two__extern"]
    pub fn is_power_of_two(x: cty::c_uint) -> bool;
}
extern "C" {
    #[doc = " @brief Arithmetic shift right\n @param value value to shift\n @param shift number of bits to shift\n @return @p value shifted right by @p shift; opened bit positions are\n         filled with the sign bit"]
    #[link_name = "arithmetic_shift_right__extern"]
    pub fn arithmetic_shift_right(value: i64, shift: u8) -> i64;
}
extern "C" {
    #[doc = " @brief byte by byte memcpy.\n\n Copy `size` bytes of `src` into `dest`. This is guaranteed to be done byte by byte.\n\n @param dst Pointer to the destination memory.\n @param src Pointer to the source of the data.\n @param size The number of bytes to copy."]
    #[link_name = "bytecpy__extern"]
    pub fn bytecpy(dst: *mut cty::c_void, src: *const cty::c_void, size: usize);
}
extern "C" {
    #[doc = " @brief byte by byte swap.\n\n Swap @a size bytes between memory regions @a a and @a b. This is\n guaranteed to be done byte by byte.\n\n @param a Pointer to the the first memory region.\n @param b Pointer to the the second memory region.\n @param size The number of bytes to swap."]
    #[link_name = "byteswp__extern"]
    pub fn byteswp(a: *mut cty::c_void, b: *mut cty::c_void, size: usize);
}
extern "C" {
    #[doc = " @brief      Convert a single character into a hexadecimal nibble.\n\n @param c     The character to convert\n @param x     The address of storage for the converted number.\n\n  @return Zero on success or (negative) error code otherwise."]
    pub fn char2hex(c: cty::c_char, x: *mut u8) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief      Convert a single hexadecimal nibble into a character.\n\n @param c     The number to convert\n @param x     The address of storage for the converted character.\n\n  @return Zero on success or (negative) error code otherwise."]
    pub fn hex2char(x: u8, c: *mut cty::c_char) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief      Convert a binary array into string representation.\n\n @param buf     The binary array to convert\n @param buflen  The length of the binary array to convert\n @param hex     Address of where to store the string representation.\n @param hexlen  Size of the storage area for string representation.\n\n @return     The length of the converted string, or 0 if an error occurred."]
    pub fn bin2hex(buf: *const u8, buflen: usize, hex: *mut cty::c_char, hexlen: usize) -> usize;
}
extern "C" {
    #[doc = " @brief      Convert a hexadecimal string into a binary array.\n\n @param hex     The hexadecimal string to convert\n @param hexlen  The length of the hexadecimal string to convert.\n @param buf     Address of where to store the binary data\n @param buflen  Size of the storage area for binary data\n\n @return     The length of the binary array, or 0 if an error occurred."]
    pub fn hex2bin(hex: *const cty::c_char, hexlen: usize, buf: *mut u8, buflen: usize) -> usize;
}
extern "C" {
    #[doc = " @brief Convert a binary coded decimal (BCD 8421) value to binary.\n\n @param bcd BCD 8421 value to convert.\n\n @return Binary representation of input value."]
    #[link_name = "bcd2bin__extern"]
    pub fn bcd2bin(bcd: u8) -> u8;
}
extern "C" {
    #[doc = " @brief Convert a binary value to binary coded decimal (BCD 8421).\n\n @param bin Binary value to convert.\n\n @return BCD 8421 representation of input value."]
    #[link_name = "bin2bcd__extern"]
    pub fn bin2bcd(bin: u8) -> u8;
}
extern "C" {
    #[doc = " @brief      Convert a uint8_t into a decimal string representation.\n\n Convert a uint8_t value into its ASCII decimal string representation.\n The string is terminated if there is enough space in buf.\n\n @param buf     Address of where to store the string representation.\n @param buflen  Size of the storage area for string representation.\n @param value   The value to convert to decimal string\n\n @return     The length of the converted string (excluding terminator if\n             any), or 0 if an error occurred."]
    pub fn u8_to_dec(buf: *mut cty::c_char, buflen: u8, value: u8) -> u8;
}
extern "C" {
    #[doc = " @brief Properly truncate a NULL-terminated UTF-8 string\n\n Take a NULL-terminated UTF-8 string and ensure that if the string has been\n truncated (by setting the NULL terminator) earlier by other means, that\n the string ends with a properly formatted UTF-8 character (1-4 bytes).\n\n @htmlonly\n Example:\n      char test_str[] = \"\";\n      char trunc_utf8[8];\n\n      printf(\"Original : %s\\n\", test_str); // \n      strncpy(trunc_utf8, test_str, sizeof(trunc_utf8));\n      trunc_utf8[sizeof(trunc_utf8) - 1] = '\\0';\n      printf(\"Bad      : %s\\n\", trunc_utf8); // \n      utf8_trunc(trunc_utf8);\n      printf(\"Truncated: %s\\n\", trunc_utf8); // \n @endhtmlonly\n\n @param utf8_str NULL-terminated string\n\n @return Pointer to the @p utf8_str"]
    pub fn utf8_trunc(utf8_str: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    #[doc = " @brief Copies a UTF-8 encoded string from @p src to @p dst\n\n The resulting @p dst will always be NULL terminated if @p n is larger than 0,\n and the @p dst string will always be properly UTF-8 truncated.\n\n @param dst The destination of the UTF-8 string.\n @param src The source string\n @param n   The size of the @p dst buffer. Maximum number of characters copied\n            is @p n - 1. If 0 nothing will be done, and the @p dst will not be\n            NULL terminated.\n\n @return Pointer to the @p dst"]
    pub fn utf8_lcpy(dst: *mut cty::c_char, src: *const cty::c_char, n: usize) -> *mut cty::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _dnode {
    pub __bindgen_anon_1: _dnode__bindgen_ty_1,
    pub __bindgen_anon_2: _dnode__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_1 {
    pub head: *mut _dnode,
    pub next: *mut _dnode,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_dnode__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_2 {
    pub tail: *mut _dnode,
    pub prev: *mut _dnode,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_dnode__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(prev)
        )
    );
}
#[test]
fn bindgen_test_layout__dnode() {
    assert_eq!(
        ::core::mem::size_of::<_dnode>(),
        16usize,
        concat!("Size of: ", stringify!(_dnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode>(),
        8usize,
        concat!("Alignment of ", stringify!(_dnode))
    );
}
#[doc = " @brief Doubly-linked list structure."]
pub type sys_dlist_t = _dnode;
#[doc = " @brief Doubly-linked list node structure."]
pub type sys_dnode_t = _dnode;
extern "C" {
    #[doc = " @brief initialize list to its empty state\n\n @param list the doubly-linked list"]
    #[link_name = "sys_dlist_init__extern"]
    pub fn sys_dlist_init(list: *mut sys_dlist_t);
}
extern "C" {
    #[doc = " @brief initialize node to its state when not in a list\n\n @param node the node"]
    #[link_name = "sys_dnode_init__extern"]
    pub fn sys_dnode_init(node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief check if a node is a member of any list\n\n @param node the node\n\n @return true if node is linked into a list, false if it is not"]
    #[link_name = "sys_dnode_is_linked__extern"]
    pub fn sys_dnode_is_linked(node: *const sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if a node is the list's head\n\n @param list the doubly-linked list to operate on\n @param node the node to check\n\n @return true if node is the head, false otherwise"]
    #[link_name = "sys_dlist_is_head__extern"]
    pub fn sys_dlist_is_head(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if a node is the list's tail\n\n @param list the doubly-linked list to operate on\n @param node the node to check\n\n @return true if node is the tail, false otherwise"]
    #[link_name = "sys_dlist_is_tail__extern"]
    pub fn sys_dlist_is_tail(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if the list is empty\n\n @param list the doubly-linked list to operate on\n\n @return true if empty, false otherwise"]
    #[link_name = "sys_dlist_is_empty__extern"]
    pub fn sys_dlist_is_empty(list: *mut sys_dlist_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if more than one node present\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n\n @return true if multiple nodes, false otherwise"]
    #[link_name = "sys_dlist_has_multiple_nodes__extern"]
    pub fn sys_dlist_has_multiple_nodes(list: *mut sys_dlist_t) -> bool;
}
extern "C" {
    #[doc = " @brief get a reference to the head item in the list\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the head element, NULL if list is empty"]
    #[link_name = "sys_dlist_peek_head__extern"]
    pub fn sys_dlist_peek_head(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the head item in the list\n\n The list must be known to be non-empty.\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the head element"]
    #[link_name = "sys_dlist_peek_head_not_empty__extern"]
    pub fn sys_dlist_peek_head_not_empty(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the next item in the list, node is not NULL\n\n Faster than sys_dlist_peek_next() if node is known not to be NULL.\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the next element in the list\n\n @return a pointer to the next element from a node, NULL if node is the tail"]
    #[link_name = "sys_dlist_peek_next_no_check__extern"]
    pub fn sys_dlist_peek_next_no_check(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
    ) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the next item in the list\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the next element in the list\n\n @return a pointer to the next element from a node, NULL if node is the tail\n or NULL (when node comes from reading the head of an empty list)."]
    #[link_name = "sys_dlist_peek_next__extern"]
    pub fn sys_dlist_peek_next(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the previous item in the list, node is not NULL\n\n Faster than sys_dlist_peek_prev() if node is known not to be NULL.\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the previous element in the list\n\n @return a pointer to the previous element from a node, NULL if node is the\n\t   tail"]
    #[link_name = "sys_dlist_peek_prev_no_check__extern"]
    pub fn sys_dlist_peek_prev_no_check(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
    ) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the previous item in the list\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the previous element in the list\n\n @return a pointer to the previous element from a node, NULL if node is the\n \t   tail or NULL (when node comes from reading the head of an empty\n \t   list)."]
    #[link_name = "sys_dlist_peek_prev__extern"]
    pub fn sys_dlist_peek_prev(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the tail item in the list\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the tail element, NULL if list is empty"]
    #[link_name = "sys_dlist_peek_tail__extern"]
    pub fn sys_dlist_peek_tail(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief add node to tail of list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to append"]
    #[link_name = "sys_dlist_append__extern"]
    pub fn sys_dlist_append(list: *mut sys_dlist_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief add node to head of list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to append"]
    #[link_name = "sys_dlist_prepend__extern"]
    pub fn sys_dlist_prepend(list: *mut sys_dlist_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief Insert a node into a list\n\n Insert a node before a specified node in a dlist.\n\n @param successor the position before which \"node\" will be inserted\n @param node the element to insert"]
    #[link_name = "sys_dlist_insert__extern"]
    pub fn sys_dlist_insert(successor: *mut sys_dnode_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief insert node at position\n\n Insert a node in a location depending on a external condition. The cond()\n function checks if the node is to be inserted _before_ the current node\n against which it is checked.\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to insert\n @param cond a function that determines if the current node is the correct\n             insert point\n @param data parameter to cond()"]
    #[link_name = "sys_dlist_insert_at__extern"]
    pub fn sys_dlist_insert_at(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
        cond: ::core::option::Option<
            unsafe extern "C" fn(node: *mut sys_dnode_t, data: *mut cty::c_void) -> cty::c_int,
        >,
        data: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief remove a specific node from a list\n\n The list is implicit from the node. The node must be part of a list.\n This and other sys_dlist_*() functions are not thread safe.\n\n @param node the node to remove"]
    #[link_name = "sys_dlist_remove__extern"]
    pub fn sys_dlist_remove(node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief get the first node in a list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n\n @return the first node in the list, NULL if list is empty"]
    #[link_name = "sys_dlist_get__extern"]
    pub fn sys_dlist_get(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_dlist_len__extern"]
    pub fn sys_dlist_len(list: *mut sys_dlist_t) -> usize;
}
#[doc = " @brief Balanced red/black tree node structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbnode {
    #[doc = " @cond INTERNAL_HIDDEN"]
    pub children: [*mut rbnode; 2usize],
}
#[test]
fn bindgen_test_layout_rbnode() {
    const UNINIT: ::core::mem::MaybeUninit<rbnode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rbnode>(),
        16usize,
        concat!("Size of: ", stringify!(rbnode))
    );
    assert_eq!(
        ::core::mem::align_of::<rbnode>(),
        8usize,
        concat!("Alignment of ", stringify!(rbnode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).children) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbnode),
            "::",
            stringify!(children)
        )
    );
}
#[doc = " @typedef rb_lessthan_t\n @brief Red/black tree comparison predicate\n\n Compares the two nodes and returns true if node A is strictly less\n than B according to the tree's sorting criteria, false otherwise.\n\n Note that during insert, the new node being inserted will always be\n \"A\", where \"B\" is the existing node within the tree against which\n it is being compared.  This trait can be used (with care!) to\n implement \"most/least recently added\" semantics between nodes which\n would otherwise compare as equal."]
pub type rb_lessthan_t =
    ::core::option::Option<unsafe extern "C" fn(a: *mut rbnode, b: *mut rbnode) -> bool>;
#[doc = " @brief Balanced red/black tree structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbtree {
    #[doc = " Root node of the tree"]
    pub root: *mut rbnode,
    #[doc = " Comparison function for nodes in the tree"]
    pub lessthan_fn: rb_lessthan_t,
    #[doc = " @cond INTERNAL_HIDDEN"]
    pub max_depth: cty::c_int,
}
#[test]
fn bindgen_test_layout_rbtree() {
    const UNINIT: ::core::mem::MaybeUninit<rbtree> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rbtree>(),
        24usize,
        concat!("Size of: ", stringify!(rbtree))
    );
    assert_eq!(
        ::core::mem::align_of::<rbtree>(),
        8usize,
        concat!("Alignment of ", stringify!(rbtree))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lessthan_fn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(lessthan_fn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_depth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(max_depth)
        )
    );
}
#[doc = " @brief Prototype for node visitor callback.\n @param node Node being visited\n @param cookie User-specified data"]
pub type rb_visit_t =
    ::core::option::Option<unsafe extern "C" fn(node: *mut rbnode, cookie: *mut cty::c_void)>;
extern "C" {
    pub fn z_rb_child(node: *mut rbnode, side: u8) -> *mut rbnode;
}
extern "C" {
    pub fn z_rb_is_black(node: *mut rbnode) -> cty::c_int;
}
extern "C" {
    pub fn z_rb_walk(node: *mut rbnode, visit_fn: rb_visit_t, cookie: *mut cty::c_void);
}
extern "C" {
    pub fn z_rb_get_minmax(tree: *mut rbtree, side: u8) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Insert node into tree"]
    pub fn rb_insert(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Remove node from tree"]
    pub fn rb_remove(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Returns the lowest-sorted member of the tree"]
    #[link_name = "rb_get_min__extern"]
    pub fn rb_get_min(tree: *mut rbtree) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Returns the highest-sorted member of the tree"]
    #[link_name = "rb_get_max__extern"]
    pub fn rb_get_max(tree: *mut rbtree) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Returns true if the given node is part of the tree\n\n Note that this does not internally dereference the node pointer\n (though the tree's lessthan callback might!), it just tests it for\n equality with items in the tree.  So it's feasible to use this to\n implement a \"set\" construct by simply testing the pointer value\n itself."]
    pub fn rb_contains(tree: *mut rbtree, node: *mut rbnode) -> bool;
}
extern "C" {
    #[doc = " @brief Walk/enumerate a rbtree\n\n Very simple recursive enumeration.  Low code size, but requiring a\n separate function can be clumsy for the user and there is no way to\n break out of the loop early.  See RB_FOR_EACH for an iterative\n implementation."]
    #[link_name = "rb_walk__extern"]
    pub fn rb_walk(tree: *mut rbtree, visit_fn: rb_visit_t, cookie: *mut cty::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rb_foreach {
    pub stack: *mut *mut rbnode,
    pub is_left: *mut u8,
    pub top: i32,
}
#[test]
fn bindgen_test_layout__rb_foreach() {
    const UNINIT: ::core::mem::MaybeUninit<_rb_foreach> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_rb_foreach>(),
        24usize,
        concat!("Size of: ", stringify!(_rb_foreach))
    );
    assert_eq!(
        ::core::mem::align_of::<_rb_foreach>(),
        8usize,
        concat!("Alignment of ", stringify!(_rb_foreach))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_left) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(is_left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(top)
        )
    );
}
extern "C" {
    pub fn z_rb_foreach_next(tree: *mut rbtree, f: *mut _rb_foreach) -> *mut rbnode;
}
extern "C" {
    pub fn z_priq_dumb_best(pq: *mut sys_dlist_t) -> *mut k_thread;
}
extern "C" {
    pub fn z_priq_dumb_remove(pq: *mut sys_dlist_t, thread: *mut k_thread);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _priq_rb {
    pub tree: rbtree,
    pub next_order_key: cty::c_int,
}
#[test]
fn bindgen_test_layout__priq_rb() {
    const UNINIT: ::core::mem::MaybeUninit<_priq_rb> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_priq_rb>(),
        32usize,
        concat!("Size of: ", stringify!(_priq_rb))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(_priq_rb))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tree) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(tree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_order_key) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(next_order_key)
        )
    );
}
extern "C" {
    pub fn z_priq_rb_add(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn z_priq_rb_remove(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn z_priq_rb_best(pq: *mut _priq_rb) -> *mut k_thread;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _priq_mq {
    pub queues: [sys_dlist_t; 32usize],
    pub bitmask: cty::c_uint,
}
#[test]
fn bindgen_test_layout__priq_mq() {
    const UNINIT: ::core::mem::MaybeUninit<_priq_mq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_priq_mq>(),
        520usize,
        concat!("Size of: ", stringify!(_priq_mq))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_mq>(),
        8usize,
        concat!("Alignment of ", stringify!(_priq_mq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).queues) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(queues)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bitmask) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(bitmask)
        )
    );
}
extern "C" {
    pub fn z_priq_mq_best(pq: *mut _priq_mq) -> *mut k_thread;
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _snode {
    pub next: *mut _snode,
}
#[test]
fn bindgen_test_layout__snode() {
    const UNINIT: ::core::mem::MaybeUninit<_snode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_snode>(),
        8usize,
        concat!("Size of: ", stringify!(_snode))
    );
    assert_eq!(
        ::core::mem::align_of::<_snode>(),
        8usize,
        concat!("Alignment of ", stringify!(_snode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_snode),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " Single-linked list node structure."]
pub type sys_snode_t = _snode;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _slist {
    pub head: *mut sys_snode_t,
    pub tail: *mut sys_snode_t,
}
#[test]
fn bindgen_test_layout__slist() {
    const UNINIT: ::core::mem::MaybeUninit<_slist> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_slist>(),
        16usize,
        concat!("Size of: ", stringify!(_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(_slist))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(tail)
        )
    );
}
#[doc = " Single-linked list structure."]
pub type sys_slist_t = _slist;
extern "C" {
    #[doc = " @brief Initialize a list\n\n @param list A pointer on the list to initialize"]
    #[link_name = "sys_slist_init__extern"]
    pub fn sys_slist_init(list: *mut sys_slist_t);
}
extern "C" {
    #[link_name = "z_snode_next_peek__extern"]
    pub fn z_snode_next_peek(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[link_name = "z_snode_next_set__extern"]
    pub fn z_snode_next_set(parent: *mut sys_snode_t, child: *mut sys_snode_t);
}
extern "C" {
    #[link_name = "z_slist_head_set__extern"]
    pub fn z_slist_head_set(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[link_name = "z_slist_tail_set__extern"]
    pub fn z_slist_tail_set(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Peek the first node from the list\n\n @param list A point on the list to peek the first node from\n\n @return A pointer on the first node of the list (or NULL if none)"]
    #[link_name = "sys_slist_peek_head__extern"]
    pub fn sys_slist_peek_head(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Peek the last node from the list\n\n @param list A point on the list to peek the last node from\n\n @return A pointer on the last node of the list (or NULL if none)"]
    #[link_name = "sys_slist_peek_tail__extern"]
    pub fn sys_slist_peek_tail(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Test if the given list is empty\n\n @param list A pointer on the list to test\n\n @return a boolean, true if it's empty, false otherwise"]
    #[link_name = "sys_slist_is_empty__extern"]
    pub fn sys_slist_is_empty(list: *mut sys_slist_t) -> bool;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node, node is not NULL\n\n Faster then sys_slist_peek_next() if node is known not to be NULL.\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_slist_peek_next_no_check__extern"]
    pub fn sys_slist_peek_next_no_check(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_slist_peek_next__extern"]
    pub fn sys_slist_peek_next(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Prepend a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to prepend"]
    #[link_name = "sys_slist_prepend__extern"]
    pub fn sys_slist_prepend(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Append a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to append"]
    #[link_name = "sys_slist_append__extern"]
    pub fn sys_slist_append(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Append a list to the given list\n\n Append a singly-linked, NULL-terminated list consisting of nodes containing\n the pointer to the next node as the first element of a node, to @a list.\n This and other sys_slist_*() functions are not thread safe.\n\n FIXME: Why are the element parameters void *?\n\n @param list A pointer on the list to affect\n @param head A pointer to the first element of the list to append\n @param tail A pointer to the last element of the list to append"]
    #[link_name = "sys_slist_append_list__extern"]
    pub fn sys_slist_append_list(
        list: *mut sys_slist_t,
        head: *mut cty::c_void,
        tail: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief merge two slists, appending the second one to the first\n\n When the operation is completed, the appending list is empty.\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param list_to_append A pointer to the list to append."]
    #[link_name = "sys_slist_merge_slist__extern"]
    pub fn sys_slist_merge_slist(list: *mut sys_slist_t, list_to_append: *mut sys_slist_t);
}
extern "C" {
    #[doc = " @brief Insert a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev A pointer on the previous node\n @param node A pointer on the node to insert"]
    #[link_name = "sys_slist_insert__extern"]
    pub fn sys_slist_insert(list: *mut sys_slist_t, prev: *mut sys_snode_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n List must be known to be non-empty.\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list"]
    #[link_name = "sys_slist_get_not_empty__extern"]
    pub fn sys_slist_get_not_empty(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list (or NULL if empty)"]
    #[link_name = "sys_slist_get__extern"]
    pub fn sys_slist_get(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Remove a node\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev_node A pointer on the previous node\n        (can be NULL, which means the node is the list's head)\n @param node A pointer on the node to remove"]
    #[link_name = "sys_slist_remove__extern"]
    pub fn sys_slist_remove(
        list: *mut sys_slist_t,
        prev_node: *mut sys_snode_t,
        node: *mut sys_snode_t,
    );
}
extern "C" {
    #[doc = " @brief Find and remove a node from a list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to remove from the list\n\n @return true if node was removed"]
    #[link_name = "sys_slist_find_and_remove__extern"]
    pub fn sys_slist_find_and_remove(list: *mut sys_slist_t, node: *mut sys_snode_t) -> bool;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_slist_len__extern"]
    pub fn sys_slist_len(list: *mut sys_slist_t) -> usize;
}
pub type unative_t = u64;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sfnode {
    pub next_and_flags: unative_t,
}
#[test]
fn bindgen_test_layout__sfnode() {
    const UNINIT: ::core::mem::MaybeUninit<_sfnode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sfnode>(),
        8usize,
        concat!("Size of: ", stringify!(_sfnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_sfnode>(),
        8usize,
        concat!("Alignment of ", stringify!(_sfnode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_and_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sfnode),
            "::",
            stringify!(next_and_flags)
        )
    );
}
#[doc = " Flagged single-linked list node structure."]
pub type sys_sfnode_t = _sfnode;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sflist {
    pub head: *mut sys_sfnode_t,
    pub tail: *mut sys_sfnode_t,
}
#[test]
fn bindgen_test_layout__sflist() {
    const UNINIT: ::core::mem::MaybeUninit<_sflist> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sflist>(),
        16usize,
        concat!("Size of: ", stringify!(_sflist))
    );
    assert_eq!(
        ::core::mem::align_of::<_sflist>(),
        8usize,
        concat!("Alignment of ", stringify!(_sflist))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(tail)
        )
    );
}
#[doc = " Flagged single-linked list structure."]
pub type sys_sflist_t = _sflist;
extern "C" {
    #[doc = " @brief Initialize a list\n\n @param list A pointer on the list to initialize"]
    #[link_name = "sys_sflist_init__extern"]
    pub fn sys_sflist_init(list: *mut sys_sflist_t);
}
extern "C" {
    #[link_name = "z_sfnode_next_peek__extern"]
    pub fn z_sfnode_next_peek(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Fetch flags value for a particular sfnode\n\n @param node A pointer to the node to fetch flags from\n @return The value of flags, which will be between 0 and 3"]
    #[link_name = "sys_sfnode_flags_get__extern"]
    pub fn sys_sfnode_flags_get(node: *mut sys_sfnode_t) -> u8;
}
extern "C" {
    #[link_name = "z_sfnode_next_set__extern"]
    pub fn z_sfnode_next_set(parent: *mut sys_sfnode_t, child: *mut sys_sfnode_t);
}
extern "C" {
    #[link_name = "z_sflist_head_set__extern"]
    pub fn z_sflist_head_set(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[link_name = "z_sflist_tail_set__extern"]
    pub fn z_sflist_tail_set(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Peek the first node from the list\n\n @param list A point on the list to peek the first node from\n\n @return A pointer on the first node of the list (or NULL if none)"]
    #[link_name = "sys_sflist_peek_head__extern"]
    pub fn sys_sflist_peek_head(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Peek the last node from the list\n\n @param list A point on the list to peek the last node from\n\n @return A pointer on the last node of the list (or NULL if none)"]
    #[link_name = "sys_sflist_peek_tail__extern"]
    pub fn sys_sflist_peek_tail(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Initialize an sflist node\n\n Set an initial flags value for this slist node, which can be a value between\n 0 and 3. These flags will persist even if the node is moved around\n within a list, removed, or transplanted to a different slist.\n\n This is ever so slightly faster than sys_sfnode_flags_set() and should\n only be used on a node that hasn't been added to any list.\n\n @param node A pointer to the node to set the flags on\n @param flags A value between 0 and 3 to set the flags value"]
    #[link_name = "sys_sfnode_init__extern"]
    pub fn sys_sfnode_init(node: *mut sys_sfnode_t, flags: u8);
}
extern "C" {
    #[doc = " @brief Set flags value for an sflist node\n\n Set a flags value for this slist node, which can be a value between\n 0 and 3. These flags will persist even if the node is moved around\n within a list, removed, or transplanted to a different slist.\n\n @param node A pointer to the node to set the flags on\n @param flags A value between 0 and 3 to set the flags value"]
    #[link_name = "sys_sfnode_flags_set__extern"]
    pub fn sys_sfnode_flags_set(node: *mut sys_sfnode_t, flags: u8);
}
extern "C" {
    #[doc = " @brief Test if the given list is empty\n\n @param list A pointer on the list to test\n\n @return a boolean, true if it's empty, false otherwise"]
    #[link_name = "sys_sflist_is_empty__extern"]
    pub fn sys_sflist_is_empty(list: *mut sys_sflist_t) -> bool;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node, node is not NULL\n\n Faster then sys_sflist_peek_next() if node is known not to be NULL.\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_sflist_peek_next_no_check__extern"]
    pub fn sys_sflist_peek_next_no_check(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_sflist_peek_next__extern"]
    pub fn sys_sflist_peek_next(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Prepend a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to prepend"]
    #[link_name = "sys_sflist_prepend__extern"]
    pub fn sys_sflist_prepend(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Append a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to append"]
    #[link_name = "sys_sflist_append__extern"]
    pub fn sys_sflist_append(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Append a list to the given list\n\n Append a singly-linked, NULL-terminated list consisting of nodes containing\n the pointer to the next node as the first element of a node, to @a list.\n This and other sys_sflist_*() functions are not thread safe.\n\n FIXME: Why are the element parameters void *?\n\n @param list A pointer on the list to affect\n @param head A pointer to the first element of the list to append\n @param tail A pointer to the last element of the list to append"]
    #[link_name = "sys_sflist_append_list__extern"]
    pub fn sys_sflist_append_list(
        list: *mut sys_sflist_t,
        head: *mut cty::c_void,
        tail: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief merge two sflists, appending the second one to the first\n\n When the operation is completed, the appending list is empty.\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param list_to_append A pointer to the list to append."]
    #[link_name = "sys_sflist_merge_sflist__extern"]
    pub fn sys_sflist_merge_sflist(list: *mut sys_sflist_t, list_to_append: *mut sys_sflist_t);
}
extern "C" {
    #[doc = " @brief Insert a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev A pointer on the previous node\n @param node A pointer on the node to insert"]
    #[link_name = "sys_sflist_insert__extern"]
    pub fn sys_sflist_insert(
        list: *mut sys_sflist_t,
        prev: *mut sys_sfnode_t,
        node: *mut sys_sfnode_t,
    );
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n List must be known to be non-empty.\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list"]
    #[link_name = "sys_sflist_get_not_empty__extern"]
    pub fn sys_sflist_get_not_empty(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list (or NULL if empty)"]
    #[link_name = "sys_sflist_get__extern"]
    pub fn sys_sflist_get(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Remove a node\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev_node A pointer on the previous node\n        (can be NULL, which means the node is the list's head)\n @param node A pointer on the node to remove"]
    #[link_name = "sys_sflist_remove__extern"]
    pub fn sys_sflist_remove(
        list: *mut sys_sflist_t,
        prev_node: *mut sys_sfnode_t,
        node: *mut sys_sfnode_t,
    );
}
extern "C" {
    #[doc = " @brief Find and remove a node from a list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to remove from the list\n\n @return true if node was removed"]
    #[link_name = "sys_sflist_find_and_remove__extern"]
    pub fn sys_sflist_find_and_remove(list: *mut sys_sflist_t, node: *mut sys_sfnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_sflist_len__extern"]
    pub fn sys_sflist_len(list: *mut sys_sflist_t) -> usize;
}
extern "C" {
    #[doc = " Tools may use this list as an entry point to identify all registered\n object types and the object cores linked to them."]
    pub static mut z_obj_type_list: sys_slist_t;
}
#[doc = " Object core statistics descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_core_stats_desc {
    #[doc = "< Internal representation stats buffer size"]
    pub raw_size: usize,
    #[doc = "< Stats buffer size used for reporting"]
    pub query_size: usize,
    #[doc = " Function pointer to retrieve internal representation of stats"]
    pub raw: ::core::option::Option<
        unsafe extern "C" fn(obj_core: *mut k_obj_core, stats: *mut cty::c_void) -> cty::c_int,
    >,
    #[doc = " Function pointer to retrieve reported statistics"]
    pub query: ::core::option::Option<
        unsafe extern "C" fn(obj_core: *mut k_obj_core, stats: *mut cty::c_void) -> cty::c_int,
    >,
    #[doc = " Function pointer to reset object's statistics"]
    pub reset:
        ::core::option::Option<unsafe extern "C" fn(obj_core: *mut k_obj_core) -> cty::c_int>,
    #[doc = " Function pointer to disable object's statistics gathering"]
    pub disable:
        ::core::option::Option<unsafe extern "C" fn(obj_core: *mut k_obj_core) -> cty::c_int>,
    #[doc = " Function pointer to enable object's statistics gathering"]
    pub enable:
        ::core::option::Option<unsafe extern "C" fn(obj_core: *mut k_obj_core) -> cty::c_int>,
}
#[test]
fn bindgen_test_layout_k_obj_core_stats_desc() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_core_stats_desc> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_core_stats_desc>(),
        56usize,
        concat!("Size of: ", stringify!(k_obj_core_stats_desc))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_core_stats_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(k_obj_core_stats_desc))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(raw_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).query_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(query_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).query) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disable) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(disable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(enable)
        )
    );
}
#[doc = " Object type structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_type {
    #[doc = "< Node within list of object types"]
    pub node: sys_snode_t,
    #[doc = "< List of objects of this object type"]
    pub list: sys_slist_t,
    #[doc = "< Unique type ID"]
    pub id: u32,
    #[doc = "< Offset to obj_core field"]
    pub obj_core_offset: usize,
}
#[test]
fn bindgen_test_layout_k_obj_type() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_type>(),
        40usize,
        concat!("Size of: ", stringify!(k_obj_type))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_type>(),
        8usize,
        concat!("Alignment of ", stringify!(k_obj_type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).obj_core_offset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(obj_core_offset)
        )
    );
}
#[doc = " Object core structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_core {
    #[doc = "< Object node within object type's list"]
    pub node: sys_snode_t,
    #[doc = "< Object type to which object belongs"]
    pub type_: *mut k_obj_type,
}
#[test]
fn bindgen_test_layout_k_obj_core() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_core> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_core>(),
        16usize,
        concat!("Size of: ", stringify!(k_obj_core))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_core>(),
        8usize,
        concat!("Alignment of ", stringify!(k_obj_core))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core),
            "::",
            stringify!(type_)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a specific object type\n\n Initializes a specific object type and links it into the object core\n framework.\n\n @param type Pointer to the object type to initialize\n @param id A means to identify the object type\n @param off Offset of object core within the structure\n\n @retval Pointer to initialized object type"]
    pub fn z_obj_type_init(type_: *mut k_obj_type, id: u32, off: usize) -> *mut k_obj_type;
}
extern "C" {
    #[doc = " @brief Find a specific object type by ID\n\n Given an object type ID, this function searches for the object type that\n is associated with the specified type ID @a type_id.\n\n @param type_id  Type ID associated with object type\n\n @retval NULL if object type not found\n @retval Pointer to object type if found"]
    pub fn k_obj_type_find(type_id: u32) -> *mut k_obj_type;
}
extern "C" {
    #[doc = " @brief Walk the object type's list of object cores\n\n This function takes a global spinlock and walks the object type's list\n of object cores and invokes the callback function on each element while\n holding that lock. Although this will ensure that the list is not modified,\n one can expect a significant penalty in terms of performance and latency.\n\n The callback function shall either return non-zero to stop further walking,\n or it shall return 0 to continue walking.\n\n @param type  Pointer to the object type\n @param func  Callback to invoke on each object core of the object type\n @param data  Custom data passed to the callback\n\n @retval non-zero if walk is terminated by the callback; otherwise 0"]
    pub fn k_obj_type_walk_locked(
        type_: *mut k_obj_type,
        func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut k_obj_core, arg2: *mut cty::c_void) -> cty::c_int,
        >,
        data: *mut cty::c_void,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Walk the object type's list of object cores\n\n This function is similar to k_obj_type_walk_locked() except that it walks\n the list without obtaining the global spinlock. No synchronization is\n provided here. Mutation of the list of objects while this function is in\n progress must be prevented at the application layer, otherwise\n undefined/unreliable behavior, corruption and/or crashes may result.\n\n The callback function shall either return non-zero to stop further walking,\n or it shall return 0 to continue walking.\n\n @param type  Pointer to the object type\n @param func  Callback to invoke on each object core of the object type\n @param data  Custom data passed to the callback\n\n @retval non-zero if walk is terminated by the callback; otherwise 0"]
    pub fn k_obj_type_walk_unlocked(
        type_: *mut k_obj_type,
        func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut k_obj_core, arg2: *mut cty::c_void) -> cty::c_int,
        >,
        data: *mut cty::c_void,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Initialize the core of the kernel object\n\n Initializing the kernel object core associates it with the specified\n kernel object type.\n\n @param obj_core Pointer to the kernel object to initialize\n @param type Pointer to the kernel object type"]
    pub fn k_obj_core_init(obj_core: *mut k_obj_core, type_: *mut k_obj_type);
}
extern "C" {
    #[doc = " @brief Link the kernel object to the kernel object type list\n\n A kernel object can be optionally linked into the kernel object type's\n list of objects. A kernel object must have been initialized before it\n can be linked. Linked kernel objects can be traversed and have information\n extracted from them by system tools.\n\n @param obj_core Pointer to the kernel object"]
    pub fn k_obj_core_link(obj_core: *mut k_obj_core);
}
extern "C" {
    #[doc = " @brief Automatically link the kernel object after initializing it\n\n A useful wrapper to both initialize the core of the kernel object and\n automatically link it into the kernel object type's list of objects.\n\n @param obj_core Pointer to the kernel object to initialize\n @param type Pointer to the kernel object type"]
    pub fn k_obj_core_init_and_link(obj_core: *mut k_obj_core, type_: *mut k_obj_type);
}
extern "C" {
    #[doc = " @brief Unlink the kernel object from the kernel object type list\n\n Kernel objects can be unlinked from their respective kernel object type\n lists. If on a list, it must be done at the end of the kernel object's life\n cycle.\n\n @param obj_core Pointer to the kernel object"]
    pub fn k_obj_core_unlink(obj_core: *mut k_obj_core);
}
extern "C" {
    #[doc = " @brief Register kernel object for gathering statistics\n\n Before a kernel object can gather statistics, it must be registered to do\n so. Registering will also automatically enable the kernel object to gather\n its statistics.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to raw kernel statistics\n @param stats_len Size of raw kernel statistics buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_register(
        obj_core: *mut k_obj_core,
        stats: *mut cty::c_void,
        stats_len: usize,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Deregister kernel object from gathering statistics\n\n Deregistering a kernel object core from gathering statistics prevents it\n from gathering any more statistics. It is expected to be invoked at the end\n of a kernel object's life cycle.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_deregister(obj_core: *mut k_obj_core) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Retrieve the raw statistics associated with the kernel object\n\n This function copies the raw statistics associated with the kernel object\n core specified by @a obj_core into the buffer @a stats. Note that the size\n of the buffer (@a stats_len) must match the size specified by the kernel\n object type's statistics descriptor.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to memory buffer into which to copy raw stats\n @param stats_len Length of the memory buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_raw(
        obj_core: *mut k_obj_core,
        stats: *mut cty::c_void,
        stats_len: usize,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Retrieve the statistics associated with the kernel object\n\n This function copies the statistics associated with the kernel object core\n specified by @a obj_core into the buffer @a stats. Unlike the raw statistics\n this may report calculated values such as averages.  Note that the size of\n the buffer (@a stats_len) must match the size specified by the kernel object\n type's statistics descriptor.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to memory buffer into which to copy the queried stats\n @param stats_len Length of the memory buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_query(
        obj_core: *mut k_obj_core,
        stats: *mut cty::c_void,
        stats_len: usize,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Reset the stats associated with the kernel object\n\n This function resets the statistics associated with the kernel object core\n specified by @a obj_core.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_reset(obj_core: *mut k_obj_core) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Stop gathering the stats associated with the kernel object\n\n This function temporarily stops the gathering of statistics associated with\n the kernel object core specified by @a obj_core. The gathering of statistics\n can be resumed by invoking :c:func :`k_obj_core_stats_enable`.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_disable(obj_core: *mut k_obj_core) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Reset the stats associated with the kernel object\n\n This function resumes the gathering of statistics associated with the kernel\n object core specified by @a obj_core.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_enable(obj_core: *mut k_obj_core) -> cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sys_memory_stats {
    pub free_bytes: usize,
    pub allocated_bytes: usize,
    pub max_allocated_bytes: usize,
}
#[test]
fn bindgen_test_layout_sys_memory_stats() {
    const UNINIT: ::core::mem::MaybeUninit<sys_memory_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sys_memory_stats>(),
        24usize,
        concat!("Size of: ", stringify!(sys_memory_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_memory_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(sys_memory_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).free_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(free_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).allocated_bytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(allocated_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_allocated_bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(max_allocated_bytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sys_heap {
    pub heap: *mut z_heap,
    pub init_mem: *mut cty::c_void,
    pub init_bytes: usize,
}
#[test]
fn bindgen_test_layout_sys_heap() {
    const UNINIT: ::core::mem::MaybeUninit<sys_heap> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sys_heap>(),
        24usize,
        concat!("Size of: ", stringify!(sys_heap))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_heap>(),
        8usize,
        concat!("Alignment of ", stringify!(sys_heap))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_mem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(init_mem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(init_bytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_heap_stress_result {
    pub total_allocs: u32,
    pub successful_allocs: u32,
    pub total_frees: u32,
    pub accumulated_in_use_bytes: u64,
}
#[test]
fn bindgen_test_layout_z_heap_stress_result() {
    const UNINIT: ::core::mem::MaybeUninit<z_heap_stress_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_heap_stress_result>(),
        24usize,
        concat!("Size of: ", stringify!(z_heap_stress_result))
    );
    assert_eq!(
        ::core::mem::align_of::<z_heap_stress_result>(),
        8usize,
        concat!("Alignment of ", stringify!(z_heap_stress_result))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_allocs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(total_allocs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).successful_allocs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(successful_allocs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_frees) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(total_frees)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).accumulated_in_use_bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(accumulated_in_use_bytes)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize sys_heap\n\n Initializes a sys_heap struct to manage the specified memory.\n\n @param heap Heap to initialize\n @param mem Untyped pointer to unused memory\n @param bytes Size of region pointed to by @a mem"]
    pub fn sys_heap_init(heap: *mut sys_heap, mem: *mut cty::c_void, bytes: usize);
}
extern "C" {
    #[doc = " @brief Allocate memory from a sys_heap\n\n Returns a pointer to a block of unused memory in the heap.  This\n memory will not otherwise be used until it is freed with\n sys_heap_free().  If no memory can be allocated, NULL will be\n returned.  The allocated memory is guaranteed to have a starting\n address which is a multiple of sizeof(void *).  If a bigger alignment\n is necessary then sys_heap_aligned_alloc() should be used instead.\n\n @note The sys_heap implementation is not internally synchronized.\n No two sys_heap functions should operate on the same heap at the\n same time.  All locking must be provided by the user.\n\n @param heap Heap from which to allocate\n @param bytes Number of bytes requested\n @return Pointer to memory the caller can now use"]
    pub fn sys_heap_alloc(heap: *mut sys_heap, bytes: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Allocate aligned memory from a sys_heap\n\n Behaves in all ways like sys_heap_alloc(), except that the returned\n memory (if available) will have a starting address in memory which\n is a multiple of the specified power-of-two alignment value in\n bytes.  With align=0 this behaves exactly like sys_heap_alloc().\n The resulting memory can be returned to the heap using sys_heap_free().\n\n @param heap Heap from which to allocate\n @param align Alignment in bytes, must be a power of two\n @param bytes Number of bytes requested\n @return Pointer to memory the caller can now use"]
    pub fn sys_heap_aligned_alloc(
        heap: *mut sys_heap,
        align: usize,
        bytes: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Free memory into a sys_heap\n\n De-allocates a pointer to memory previously returned from\n sys_heap_alloc such that it can be used for other purposes.  The\n caller must not use the memory region after entry to this function.\n\n @note The sys_heap implementation is not internally synchronized.\n No two sys_heap functions should operate on the same heap at the\n same time.  All locking must be provided by the user.\n\n @param heap Heap to which to return the memory\n @param mem A pointer previously returned from sys_heap_alloc()"]
    pub fn sys_heap_free(heap: *mut sys_heap, mem: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Expand the size of an existing allocation\n\n Returns a pointer to a new memory region with the same contents,\n but a different allocated size.  If the new allocation can be\n expanded in place, the pointer returned will be identical.\n Otherwise the data will be copies to a new block and the old one\n will be freed as per sys_heap_free().  If the specified size is\n smaller than the original, the block will be truncated in place and\n the remaining memory returned to the heap.  If the allocation of a\n new block fails, then NULL will be returned and the old block will\n not be freed or modified.\n\n @note The return of a NULL on failure is a different behavior than\n POSIX realloc(), which specifies that the original pointer will be\n returned (i.e. it is not possible to safely detect realloc()\n failure in POSIX, but it is here).\n\n @param heap Heap from which to allocate\n @param ptr Original pointer returned from a previous allocation\n @param align Alignment in bytes, must be a power of two\n @param bytes Number of bytes requested for the new block\n @return Pointer to memory the caller can now use, or NULL"]
    pub fn sys_heap_aligned_realloc(
        heap: *mut sys_heap,
        ptr: *mut cty::c_void,
        align: usize,
        bytes: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Return allocated memory size\n\n Returns the size, in bytes, of a block returned from a successful\n sys_heap_alloc() or sys_heap_alloc_aligned() call.  The value\n returned is the size of the heap-managed memory, which may be\n larger than the number of bytes requested due to allocation\n granularity.  The heap code is guaranteed to make no access to this\n region of memory until a subsequent sys_heap_free() on the same\n pointer.\n\n @param heap Heap containing the block\n @param mem Pointer to memory allocated from this heap\n @return Size in bytes of the memory region"]
    pub fn sys_heap_usable_size(heap: *mut sys_heap, mem: *mut cty::c_void) -> usize;
}
extern "C" {
    #[doc = " @brief Validate heap integrity\n\n Validates the internal integrity of a sys_heap.  Intended for unit\n test and validation code, though potentially useful as a user API\n for applications with complicated runtime reliability requirements.\n Note: this cannot catch every possible error, but if it returns\n true then the heap is in a consistent state and can correctly\n handle any sys_heap_alloc() request and free any live pointer\n returned from a previous allocation.\n\n @param heap Heap to validate\n @return true, if the heap is valid, otherwise false"]
    pub fn sys_heap_validate(heap: *mut sys_heap) -> bool;
}
extern "C" {
    #[doc = " @brief sys_heap stress test rig\n\n Test rig for heap allocation validation.  This will loop for @a\n op_count cycles, in each iteration making a random choice to\n allocate or free a pointer of randomized (power law) size based on\n heuristics designed to keep the heap in a state where it is near @a\n target_percent full.  Allocation and free operations are provided\n by the caller as callbacks (i.e. this can in theory test any heap).\n Results, including counts of frees and successful/unsuccessful\n allocations, are returned via the @a result struct.\n\n @param alloc_fn Callback to perform an allocation.  Passes back the @a\n              arg parameter as a context handle.\n @param free_fn Callback to perform a free of a pointer returned from\n             @a alloc.  Passes back the @a arg parameter as a\n             context handle.\n @param arg Context handle to pass back to the callbacks\n @param total_bytes Size of the byte array the heap was initialized in\n @param op_count How many iterations to test\n @param scratch_mem A pointer to scratch memory to be used by the\n                    test.  Should be about 1/2 the size of the heap\n                    for tests that need to stress fragmentation.\n @param scratch_bytes Size of the memory pointed to by @a scratch_mem\n @param target_percent Percentage fill value (1-100) to which the\n                       random allocation choices will seek.  High\n                       values will result in significant allocation\n                       failures and a very fragmented heap.\n @param result Struct into which to store test results."]
    pub fn sys_heap_stress(
        alloc_fn: ::core::option::Option<
            unsafe extern "C" fn(arg: *mut cty::c_void, bytes: usize) -> *mut cty::c_void,
        >,
        free_fn: ::core::option::Option<
            unsafe extern "C" fn(arg: *mut cty::c_void, p: *mut cty::c_void),
        >,
        arg: *mut cty::c_void,
        total_bytes: usize,
        op_count: u32,
        scratch_mem: *mut cty::c_void,
        scratch_bytes: usize,
        target_percent: cty::c_int,
        result: *mut z_heap_stress_result,
    );
}
extern "C" {
    #[doc = " @brief Print heap internal structure information to the console\n\n Print information on the heap structure such as its size, chunk buckets,\n chunk list and some statistics for debugging purpose.\n\n @param heap Heap to print information about\n @param dump_chunks True to print the entire heap chunk list"]
    pub fn sys_heap_print_info(heap: *mut sys_heap, dump_chunks: bool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpu_arch {
    is_empty: bool
}
#[test]
fn bindgen_test_layout__cpu_arch() {
    assert_eq!(
        ::core::mem::size_of::<_cpu_arch>(),
        0usize,
        concat!("Size of: ", stringify!(_cpu_arch))
    );
    assert_eq!(
        ::core::mem::align_of::<_cpu_arch>(),
        1usize,
        concat!("Alignment of ", stringify!(_cpu_arch))
    );
}
pub type _cpu_arch_t = _cpu_arch;
#[doc = " Structure used to track internal statistics about both thread\n and CPU usage."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_cycle_stats {
    #[doc = "< total usage in cycles"]
    pub total: u64,
    #[doc = "< true if gathering usage stats"]
    pub track_usage: bool,
}
#[test]
fn bindgen_test_layout_k_cycle_stats() {
    const UNINIT: ::core::mem::MaybeUninit<k_cycle_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_cycle_stats>(),
        16usize,
        concat!("Size of: ", stringify!(k_cycle_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<k_cycle_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(k_cycle_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_cycle_stats),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).track_usage) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_cycle_stats),
            "::",
            stringify!(track_usage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ready_q {
    pub cache: *mut k_thread,
}
#[test]
fn bindgen_test_layout__ready_q() {
    const UNINIT: ::core::mem::MaybeUninit<_ready_q> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ready_q>(),
        8usize,
        concat!("Size of: ", stringify!(_ready_q))
    );
    assert_eq!(
        ::core::mem::align_of::<_ready_q>(),
        8usize,
        concat!("Alignment of ", stringify!(_ready_q))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cache) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ready_q),
            "::",
            stringify!(cache)
        )
    );
}
pub type _ready_q_t = _ready_q;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpu {
    pub nested: u32,
    pub irq_stack: *mut cty::c_char,
    pub current: *mut k_thread,
    pub idle_thread: *mut k_thread,
    pub id: u8,
    pub arch: _cpu_arch,
}
#[test]
fn bindgen_test_layout__cpu() {
    const UNINIT: ::core::mem::MaybeUninit<_cpu> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_cpu>(),
        40usize,
        concat!("Size of: ", stringify!(_cpu))
    );
    assert_eq!(
        ::core::mem::align_of::<_cpu>(),
        8usize,
        concat!("Alignment of ", stringify!(_cpu))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nested) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(nested)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(irq_stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idle_thread) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(idle_thread)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(_cpu), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arch) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(arch)
        )
    );
}
pub type _cpu_t = _cpu;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_kernel {
    pub cpus: [_cpu; 1usize],
    pub ready_q: _ready_q,
}
#[test]
fn bindgen_test_layout_z_kernel() {
    const UNINIT: ::core::mem::MaybeUninit<z_kernel> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_kernel>(),
        48usize,
        concat!("Size of: ", stringify!(z_kernel))
    );
    assert_eq!(
        ::core::mem::align_of::<z_kernel>(),
        8usize,
        concat!("Alignment of ", stringify!(z_kernel))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_kernel),
            "::",
            stringify!(cpus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ready_q) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(z_kernel),
            "::",
            stringify!(ready_q)
        )
    );
}
pub type _kernel_t = z_kernel;
extern "C" {
    pub static mut _kernel: z_kernel;
}
extern "C" {
    pub static mut _cpus_active: atomic_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _wait_q_t {
    pub waitq: sys_dlist_t,
}
#[test]
fn bindgen_test_layout__wait_q_t() {
    const UNINIT: ::core::mem::MaybeUninit<_wait_q_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_wait_q_t>(),
        16usize,
        concat!("Size of: ", stringify!(_wait_q_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_wait_q_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_wait_q_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).waitq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_wait_q_t),
            "::",
            stringify!(waitq)
        )
    );
}
pub type _timeout_func_t = ::core::option::Option<unsafe extern "C" fn(t: *mut _timeout)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _timeout {
    pub node: sys_dnode_t,
    pub fn_: _timeout_func_t,
    pub dticks: i32,
}
#[test]
fn bindgen_test_layout__timeout() {
    const UNINIT: ::core::mem::MaybeUninit<_timeout> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_timeout>(),
        32usize,
        concat!("Size of: ", stringify!(_timeout))
    );
    assert_eq!(
        ::core::mem::align_of::<_timeout>(),
        8usize,
        concat!("Alignment of ", stringify!(_timeout))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fn_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(fn_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dticks) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(dticks)
        )
    );
}
pub type k_thread_timeslice_fn_t =
    ::core::option::Option<unsafe extern "C" fn(thread: *mut k_thread, data: *mut cty::c_void)>;
extern "C" {
    #[doc = " @brief Return the kernel version of the present build\n\n The kernel version is a four-byte value, whose format is described in the\n file \"kernel_version.h\".\n\n @return kernel version"]
    pub fn sys_kernel_version_get() -> u32;
}
#[doc = " @typedef _k_syscall_handler_t\n @brief System call handler function type\n\n These are kernel-side skeleton functions for system calls. They are\n necessary to sanitize the arguments passed into the system call:\n\n - Any kernel object or device pointers are validated with _SYSCALL_IS_OBJ()\n - Any memory buffers passed in are checked to ensure that the calling thread\n   actually has access to them\n - Many kernel calls do no sanity checking of parameters other than\n   assertions. The handler must check all of these conditions using\n   _SYSCALL_ASSERT()\n - If the system call has more than 6 arguments, then arg6 will be a pointer\n   to some struct containing arguments 6+. The struct itself needs to be\n   validated like any other buffer passed in from userspace, and its members\n   individually validated (if necessary) and then passed to the real\n   implementation like normal arguments\n\n Even if the system call implementation has no return value, these always\n return something, even 0, to prevent register leakage to userspace.\n\n Once everything has been validated, the real implementation will be executed.\n\n @param arg1 system call argument 1\n @param arg2 system call argument 2\n @param arg3 system call argument 3\n @param arg4 system call argument 4\n @param arg5 system call argument 5\n @param arg6 system call argument 6\n @param ssf System call stack frame pointer. Used to generate kernel oops\n            via _arch_syscall_oops_at(). Contents are arch-specific.\n @return system call return value, or 0 if the system call implementation\n         return void\n"]
pub type _k_syscall_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: usize,
        arg2: usize,
        arg3: usize,
        arg4: usize,
        arg5: usize,
        arg6: usize,
        ssf: *mut cty::c_void,
    ) -> usize,
>;
extern "C" {
    #[link_name = "z_syscall_trap__extern"]
    pub fn z_syscall_trap() -> bool;
}
extern "C" {
    #[doc = " Indicate whether the CPU is currently in user mode\n\n @return true if the CPU is currently running with user permissions"]
    #[link_name = "k_is_user_context__extern"]
    pub fn k_is_user_context() -> bool;
}
pub type __gwchar_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: cty::c_long,
    pub rem: cty::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: cty::c_int,
    ) -> uintmax_t;
}
extern "C" {
    #[link_name = "vprintk__extern"]
    pub fn vprintk(fmt: *const cty::c_char, ap: *mut __va_list_tag);
}
extern "C" {
    pub fn snprintk(
        str_: *mut cty::c_char,
        size: usize,
        fmt: *const cty::c_char,
        ...
    ) -> cty::c_int;
}
extern "C" {
    pub fn vsnprintk(
        str_: *mut cty::c_char,
        size: usize,
        fmt: *const cty::c_char,
        ap: *mut __va_list_tag,
    ) -> cty::c_int;
}
pub type irq_offload_routine_t =
    ::core::option::Option<unsafe extern "C" fn(parameter: *const cty::c_void)>;
extern "C" {
    #[doc = " @brief Run a function in interrupt context\n\n This function synchronously runs the provided function in interrupt\n context, passing in the supplied device. Useful for test code\n which needs to show that kernel objects work correctly in interrupt\n context.\n\n Additionally, when CONFIG_IRQ_OFFLOAD_NESTED is set by the\n architecture, this routine works to synchronously invoke a nested\n interrupt when called from an ISR context (i.e. when k_is_in_isr()\n is true).  Note that not all platforms will have hardware support\n for this capability, and even on those some interrupts may be\n running at unpreemptible priorities.\n\n @param routine The function to run\n @param parameter Argument to pass to the function when it is run as an\n interrupt"]
    pub fn irq_offload(routine: irq_offload_routine_t, parameter: *const cty::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_domain {
    _unused: [u8; 0],
}
pub type k_thread_stack_t = z_thread_stack_element;
pub type k_thread_entry_t = ::core::option::Option<
    unsafe extern "C" fn(p1: *mut cty::c_void, p2: *mut cty::c_void, p3: *mut cty::c_void),
>;
extern "C" {
    #[doc = " Obtain the current cycle count, in units specified by\n CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC.  While this is historically\n specified as part of the architecture API, in practice virtually\n all platforms forward it to the sys_clock_cycle_get_32() API\n provided by the timer driver.\n\n @see k_cycle_get_32()\n\n @return The current cycle time.  This should count up monotonically\n through the full 32 bit space, wrapping at 0xffffffff.  Hardware\n with fewer bits of precision in the timer is expected to synthesize\n a 32 bit count."]
    #[link_name = "arch_k_cycle_get_32__extern"]
    pub fn arch_k_cycle_get_32() -> u32;
}
extern "C" {
    #[doc = " As for arch_k_cycle_get_32(), but with a 64 bit return value.  Not\n all timer hardware has a 64 bit timer, this needs to be implemented\n only if CONFIG_TIMER_HAS_64BIT_CYCLE_COUNTER is set.\n\n @see arch_k_cycle_get_32()\n\n @return The current cycle time.  This should count up monotonically\n through the full 64 bit space, wrapping at 2^64-1.  Hardware with\n fewer bits of precision in the timer is generally not expected to\n implement this API."]
    #[link_name = "arch_k_cycle_get_64__extern"]
    pub fn arch_k_cycle_get_64() -> u64;
}
extern "C" {
    #[doc = " @brief Power save idle routine\n\n This function will be called by the kernel idle loop or possibly within\n an implementation of z_pm_save_idle in the kernel when the\n '_pm_save_flag' variable is non-zero.\n\n Architectures that do not implement power management instructions may\n immediately return, otherwise a power-saving instruction should be\n issued to wait for an interrupt.\n\n @note The function is expected to return after the interrupt that has\n caused the CPU to exit power-saving mode has been serviced, although\n this is not a firm requirement.\n\n @see k_cpu_idle()"]
    pub fn arch_cpu_idle();
}
extern "C" {
    #[doc = " @brief Atomically re-enable interrupts and enter low power mode\n\n The requirements for arch_cpu_atomic_idle() are as follows:\n\n -# Enabling interrupts and entering a low-power mode needs to be\n    atomic, i.e. there should be no period of time where interrupts are\n    enabled before the processor enters a low-power mode.  See the comments\n    in k_lifo_get(), for example, of the race condition that\n    occurs if this requirement is not met.\n\n -# After waking up from the low-power mode, the interrupt lockout state\n    must be restored as indicated in the 'key' input parameter.\n\n @see k_cpu_atomic_idle()\n\n @param key Lockout key returned by previous invocation of arch_irq_lock()"]
    pub fn arch_cpu_atomic_idle(key: cty::c_uint);
}
#[doc = " Per-cpu entry function\n\n @param data context parameter, implementation specific"]
pub type arch_cpustart_t =
    ::core::option::Option<unsafe extern "C" fn(data: *mut cty::c_void) -> !>;
extern "C" {
    #[doc = " @brief Start a numbered CPU on a MP-capable system\n\n This starts and initializes a specific CPU.  The main thread on startup is\n running on CPU zero, other processors are numbered sequentially.  On return\n from this function, the CPU is known to have begun operating and will enter\n the provided function.  Its interrupts will be initialized but disabled such\n that irq_unlock() with the provided key will work to enable them.\n\n Normally, in SMP mode this function will be called by the kernel\n initialization and should not be used as a user API.  But it is defined here\n for special-purpose apps which want Zephyr running on one core and to use\n others for design-specific processing.\n\n @param cpu_num Integer number of the CPU\n @param stack Stack memory for the CPU\n @param sz Stack buffer size, in bytes\n @param fn Function to begin running on the CPU.\n @param arg Untyped argument to be passed to \"fn\""]
    pub fn arch_start_cpu(
        cpu_num: cty::c_int,
        stack: *mut k_thread_stack_t,
        sz: cty::c_int,
        fn_: arch_cpustart_t,
        arg: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief Return CPU power status\n\n @param cpu_num Integer number of the CPU"]
    pub fn arch_cpu_active(cpu_num: cty::c_int) -> bool;
}
extern "C" {
    #[doc = " Lock interrupts on the current CPU\n\n @see irq_lock()"]
    #[link_name = "arch_irq_lock__extern"]
    pub fn arch_irq_lock() -> cty::c_uint;
}
extern "C" {
    #[doc = " Unlock interrupts on the current CPU\n\n @see irq_unlock()"]
    #[link_name = "arch_irq_unlock__extern"]
    pub fn arch_irq_unlock(key: cty::c_uint);
}
extern "C" {
    #[doc = " Test if calling arch_irq_unlock() with this key would unlock irqs\n\n @param key value returned by arch_irq_lock()\n @return true if interrupts were unlocked prior to the arch_irq_lock()\n call that produced the key argument."]
    #[link_name = "arch_irq_unlocked__extern"]
    pub fn arch_irq_unlocked(key: cty::c_uint) -> bool;
}
extern "C" {
    #[doc = " Disable the specified interrupt line\n\n @note: The behavior of interrupts that arrive after this call\n returns and before the corresponding call to arch_irq_enable() is\n undefined.  The hardware is not required to latch and deliver such\n an interrupt, though on some architectures that may work.  Other\n architectures will simply lose such an interrupt and never deliver\n it.  Many drivers and subsystems are not tolerant of such dropped\n interrupts and it is the job of the application layer to ensure\n that behavior remains correct.\n\n @see irq_disable()"]
    pub fn arch_irq_disable(irq: cty::c_uint);
}
extern "C" {
    #[doc = " Enable the specified interrupt line\n\n @see irq_enable()"]
    pub fn arch_irq_enable(irq: cty::c_uint);
}
extern "C" {
    #[doc = " Test if an interrupt line is enabled\n\n @see irq_is_enabled()"]
    pub fn arch_irq_is_enabled(irq: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[doc = " Arch-specific hook to install a dynamic interrupt.\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flag\n\n @return The vector assigned to this interrupt"]
    pub fn arch_irq_connect_dynamic(
        irq: cty::c_uint,
        priority: cty::c_uint,
        routine: ::core::option::Option<unsafe extern "C" fn(parameter: *const cty::c_void)>,
        parameter: *const cty::c_void,
        flags: u32,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " Arch-specific hook to dynamically uninstall a shared interrupt.\n If the interrupt is not being shared, then the associated\n _sw_isr_table entry will be replaced by (NULL, z_irq_spurious)\n (default entry).\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flag\n\n @return 0 in case of success, negative value otherwise"]
    pub fn arch_irq_disconnect_dynamic(
        irq: cty::c_uint,
        priority: cty::c_uint,
        routine: ::core::option::Option<unsafe extern "C" fn(parameter: *const cty::c_void)>,
        parameter: *const cty::c_void,
        flags: u32,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Arch-specific hook for allocating IRQs\n\n Note: disable/enable IRQ relevantly inside the implementation of such\n function to avoid concurrency issues. Also, an allocated IRQ is assumed\n to be used thus a following @see arch_irq_is_used() should return true.\n\n @return The newly allocated IRQ or UINT_MAX on error."]
    pub fn arch_irq_allocate() -> cty::c_uint;
}
extern "C" {
    #[doc = " @brief Arch-specific hook for declaring an IRQ being used\n\n Note: disable/enable IRQ relevantly inside the implementation of such\n function to avoid concurrency issues.\n\n @param irq the IRQ to declare being used"]
    pub fn arch_irq_set_used(irq: cty::c_uint);
}
extern "C" {
    #[doc = " @brief Arch-specific hook for checking if an IRQ is being used already\n\n @param irq the IRQ to check\n\n @return true if being, false otherwise"]
    pub fn arch_irq_is_used(irq: cty::c_uint) -> bool;
}
extern "C" {
    #[doc = " @brief Returns the number of CPUs\n\n For most systems this will be the same as CONFIG_MP_MAX_NUM_CPUS,\n however some systems may determine this at runtime instead.\n\n @return the number of CPUs"]
    #[link_name = "arch_num_cpus__extern"]
    pub fn arch_num_cpus() -> cty::c_uint;
}
extern "C" {
    #[link_name = "arch_mem_coherent__extern"]
    pub fn arch_mem_coherent(ptr: *mut cty::c_void) -> bool;
}
extern "C" {
    #[link_name = "arch_cohere_stacks__extern"]
    pub fn arch_cohere_stacks(
        old_thread: *mut k_thread,
        old_switch_handle: *mut cty::c_void,
        new_thread: *mut k_thread,
    );
}
extern "C" {
    #[doc = " @brief Perform architecture specific processing within spin loops\n\n This is invoked from busy loops with IRQs disabled such as the contended\n spinlock loop. The default implementation is a weak function that calls\n arch_nop(). Architectures may implement this function to perform extra\n checks or power management tricks if needed."]
    pub fn arch_spin_relax();
}
extern "C" {
    #[link_name = "read_ccsidr_el1__extern"]
    pub fn read_ccsidr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_ccsidr_el1__extern"]
    pub fn write_ccsidr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_ccsidr_el1__extern"]
    pub fn zero_ccsidr_el1();
}
extern "C" {
    #[link_name = "read_clidr_el1__extern"]
    pub fn read_clidr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_clidr_el1__extern"]
    pub fn write_clidr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_clidr_el1__extern"]
    pub fn zero_clidr_el1();
}
extern "C" {
    #[link_name = "read_cntfrq_el0__extern"]
    pub fn read_cntfrq_el0() -> u64;
}
extern "C" {
    #[link_name = "write_cntfrq_el0__extern"]
    pub fn write_cntfrq_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_cntfrq_el0__extern"]
    pub fn zero_cntfrq_el0();
}
extern "C" {
    #[link_name = "read_cnthctl_el2__extern"]
    pub fn read_cnthctl_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cnthctl_el2__extern"]
    pub fn write_cnthctl_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cnthctl_el2__extern"]
    pub fn zero_cnthctl_el2();
}
extern "C" {
    #[link_name = "read_cnthp_ctl_el2__extern"]
    pub fn read_cnthp_ctl_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cnthp_ctl_el2__extern"]
    pub fn write_cnthp_ctl_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cnthp_ctl_el2__extern"]
    pub fn zero_cnthp_ctl_el2();
}
extern "C" {
    #[link_name = "read_cnthps_ctl_el2__extern"]
    pub fn read_cnthps_ctl_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cnthps_ctl_el2__extern"]
    pub fn write_cnthps_ctl_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cnthps_ctl_el2__extern"]
    pub fn zero_cnthps_ctl_el2();
}
extern "C" {
    #[link_name = "read_cntv_ctl_el0__extern"]
    pub fn read_cntv_ctl_el0() -> u64;
}
extern "C" {
    #[link_name = "write_cntv_ctl_el0__extern"]
    pub fn write_cntv_ctl_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_cntv_ctl_el0__extern"]
    pub fn zero_cntv_ctl_el0();
}
extern "C" {
    #[link_name = "read_cntv_cval_el0__extern"]
    pub fn read_cntv_cval_el0() -> u64;
}
extern "C" {
    #[link_name = "write_cntv_cval_el0__extern"]
    pub fn write_cntv_cval_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_cntv_cval_el0__extern"]
    pub fn zero_cntv_cval_el0();
}
extern "C" {
    #[link_name = "read_cntvct_el0__extern"]
    pub fn read_cntvct_el0() -> u64;
}
extern "C" {
    #[link_name = "write_cntvct_el0__extern"]
    pub fn write_cntvct_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_cntvct_el0__extern"]
    pub fn zero_cntvct_el0();
}
extern "C" {
    #[link_name = "read_cntvoff_el2__extern"]
    pub fn read_cntvoff_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cntvoff_el2__extern"]
    pub fn write_cntvoff_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cntvoff_el2__extern"]
    pub fn zero_cntvoff_el2();
}
extern "C" {
    #[link_name = "read_currentel__extern"]
    pub fn read_currentel() -> u64;
}
extern "C" {
    #[link_name = "write_currentel__extern"]
    pub fn write_currentel(val: u64);
}
extern "C" {
    #[link_name = "zero_currentel__extern"]
    pub fn zero_currentel();
}
extern "C" {
    #[link_name = "read_csselr_el1__extern"]
    pub fn read_csselr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_csselr_el1__extern"]
    pub fn write_csselr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_csselr_el1__extern"]
    pub fn zero_csselr_el1();
}
extern "C" {
    #[link_name = "read_daif__extern"]
    pub fn read_daif() -> u64;
}
extern "C" {
    #[link_name = "write_daif__extern"]
    pub fn write_daif(val: u64);
}
extern "C" {
    #[link_name = "zero_daif__extern"]
    pub fn zero_daif();
}
extern "C" {
    #[link_name = "read_hcr_el2__extern"]
    pub fn read_hcr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_hcr_el2__extern"]
    pub fn write_hcr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_hcr_el2__extern"]
    pub fn zero_hcr_el2();
}
extern "C" {
    #[link_name = "read_id_aa64pfr0_el1__extern"]
    pub fn read_id_aa64pfr0_el1() -> u64;
}
extern "C" {
    #[link_name = "write_id_aa64pfr0_el1__extern"]
    pub fn write_id_aa64pfr0_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_id_aa64pfr0_el1__extern"]
    pub fn zero_id_aa64pfr0_el1();
}
extern "C" {
    #[link_name = "read_id_aa64mmfr0_el1__extern"]
    pub fn read_id_aa64mmfr0_el1() -> u64;
}
extern "C" {
    #[link_name = "write_id_aa64mmfr0_el1__extern"]
    pub fn write_id_aa64mmfr0_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_id_aa64mmfr0_el1__extern"]
    pub fn zero_id_aa64mmfr0_el1();
}
extern "C" {
    #[link_name = "read_mpidr_el1__extern"]
    pub fn read_mpidr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_mpidr_el1__extern"]
    pub fn write_mpidr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_mpidr_el1__extern"]
    pub fn zero_mpidr_el1();
}
extern "C" {
    #[link_name = "read_par_el1__extern"]
    pub fn read_par_el1() -> u64;
}
extern "C" {
    #[link_name = "write_par_el1__extern"]
    pub fn write_par_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_par_el1__extern"]
    pub fn zero_par_el1();
}
extern "C" {
    #[link_name = "read_scr_el3__extern"]
    pub fn read_scr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_scr_el3__extern"]
    pub fn write_scr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_scr_el3__extern"]
    pub fn zero_scr_el3();
}
extern "C" {
    #[link_name = "read_tpidrro_el0__extern"]
    pub fn read_tpidrro_el0() -> u64;
}
extern "C" {
    #[link_name = "write_tpidrro_el0__extern"]
    pub fn write_tpidrro_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_tpidrro_el0__extern"]
    pub fn zero_tpidrro_el0();
}
extern "C" {
    #[link_name = "read_vmpidr_el2__extern"]
    pub fn read_vmpidr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_vmpidr_el2__extern"]
    pub fn write_vmpidr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_vmpidr_el2__extern"]
    pub fn zero_vmpidr_el2();
}
extern "C" {
    #[link_name = "read_sp_el0__extern"]
    pub fn read_sp_el0() -> u64;
}
extern "C" {
    #[link_name = "write_sp_el0__extern"]
    pub fn write_sp_el0(val: u64);
}
extern "C" {
    #[link_name = "zero_sp_el0__extern"]
    pub fn zero_sp_el0();
}
extern "C" {
    #[link_name = "read_actlr_el1__extern"]
    pub fn read_actlr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_actlr_el1__extern"]
    pub fn write_actlr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_actlr_el1__extern"]
    pub fn zero_actlr_el1();
}
extern "C" {
    #[link_name = "read_actlr_el2__extern"]
    pub fn read_actlr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_actlr_el2__extern"]
    pub fn write_actlr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_actlr_el2__extern"]
    pub fn zero_actlr_el2();
}
extern "C" {
    #[link_name = "read_actlr_el3__extern"]
    pub fn read_actlr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_actlr_el3__extern"]
    pub fn write_actlr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_actlr_el3__extern"]
    pub fn zero_actlr_el3();
}
extern "C" {
    #[link_name = "read_cpacr_el1__extern"]
    pub fn read_cpacr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_cpacr_el1__extern"]
    pub fn write_cpacr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_cpacr_el1__extern"]
    pub fn zero_cpacr_el1();
}
extern "C" {
    #[link_name = "read_cpacr_el2__extern"]
    pub fn read_cpacr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cpacr_el2__extern"]
    pub fn write_cpacr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cpacr_el2__extern"]
    pub fn zero_cpacr_el2();
}
extern "C" {
    #[link_name = "read_cpacr_el3__extern"]
    pub fn read_cpacr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_cpacr_el3__extern"]
    pub fn write_cpacr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_cpacr_el3__extern"]
    pub fn zero_cpacr_el3();
}
extern "C" {
    #[link_name = "read_cptr_el1__extern"]
    pub fn read_cptr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_cptr_el1__extern"]
    pub fn write_cptr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_cptr_el1__extern"]
    pub fn zero_cptr_el1();
}
extern "C" {
    #[link_name = "read_cptr_el2__extern"]
    pub fn read_cptr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_cptr_el2__extern"]
    pub fn write_cptr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_cptr_el2__extern"]
    pub fn zero_cptr_el2();
}
extern "C" {
    #[link_name = "read_cptr_el3__extern"]
    pub fn read_cptr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_cptr_el3__extern"]
    pub fn write_cptr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_cptr_el3__extern"]
    pub fn zero_cptr_el3();
}
extern "C" {
    #[link_name = "read_elr_el1__extern"]
    pub fn read_elr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_elr_el1__extern"]
    pub fn write_elr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_elr_el1__extern"]
    pub fn zero_elr_el1();
}
extern "C" {
    #[link_name = "read_elr_el2__extern"]
    pub fn read_elr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_elr_el2__extern"]
    pub fn write_elr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_elr_el2__extern"]
    pub fn zero_elr_el2();
}
extern "C" {
    #[link_name = "read_elr_el3__extern"]
    pub fn read_elr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_elr_el3__extern"]
    pub fn write_elr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_elr_el3__extern"]
    pub fn zero_elr_el3();
}
extern "C" {
    #[link_name = "read_esr_el1__extern"]
    pub fn read_esr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_esr_el1__extern"]
    pub fn write_esr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_esr_el1__extern"]
    pub fn zero_esr_el1();
}
extern "C" {
    #[link_name = "read_esr_el2__extern"]
    pub fn read_esr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_esr_el2__extern"]
    pub fn write_esr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_esr_el2__extern"]
    pub fn zero_esr_el2();
}
extern "C" {
    #[link_name = "read_esr_el3__extern"]
    pub fn read_esr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_esr_el3__extern"]
    pub fn write_esr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_esr_el3__extern"]
    pub fn zero_esr_el3();
}
extern "C" {
    #[link_name = "read_far_el1__extern"]
    pub fn read_far_el1() -> u64;
}
extern "C" {
    #[link_name = "write_far_el1__extern"]
    pub fn write_far_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_far_el1__extern"]
    pub fn zero_far_el1();
}
extern "C" {
    #[link_name = "read_far_el2__extern"]
    pub fn read_far_el2() -> u64;
}
extern "C" {
    #[link_name = "write_far_el2__extern"]
    pub fn write_far_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_far_el2__extern"]
    pub fn zero_far_el2();
}
extern "C" {
    #[link_name = "read_far_el3__extern"]
    pub fn read_far_el3() -> u64;
}
extern "C" {
    #[link_name = "write_far_el3__extern"]
    pub fn write_far_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_far_el3__extern"]
    pub fn zero_far_el3();
}
extern "C" {
    #[link_name = "read_mair_el1__extern"]
    pub fn read_mair_el1() -> u64;
}
extern "C" {
    #[link_name = "write_mair_el1__extern"]
    pub fn write_mair_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_mair_el1__extern"]
    pub fn zero_mair_el1();
}
extern "C" {
    #[link_name = "read_mair_el2__extern"]
    pub fn read_mair_el2() -> u64;
}
extern "C" {
    #[link_name = "write_mair_el2__extern"]
    pub fn write_mair_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_mair_el2__extern"]
    pub fn zero_mair_el2();
}
extern "C" {
    #[link_name = "read_mair_el3__extern"]
    pub fn read_mair_el3() -> u64;
}
extern "C" {
    #[link_name = "write_mair_el3__extern"]
    pub fn write_mair_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_mair_el3__extern"]
    pub fn zero_mair_el3();
}
extern "C" {
    #[link_name = "read_sctlr_el1__extern"]
    pub fn read_sctlr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_sctlr_el1__extern"]
    pub fn write_sctlr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_sctlr_el1__extern"]
    pub fn zero_sctlr_el1();
}
extern "C" {
    #[link_name = "read_sctlr_el2__extern"]
    pub fn read_sctlr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_sctlr_el2__extern"]
    pub fn write_sctlr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_sctlr_el2__extern"]
    pub fn zero_sctlr_el2();
}
extern "C" {
    #[link_name = "read_sctlr_el3__extern"]
    pub fn read_sctlr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_sctlr_el3__extern"]
    pub fn write_sctlr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_sctlr_el3__extern"]
    pub fn zero_sctlr_el3();
}
extern "C" {
    #[link_name = "read_spsr_el1__extern"]
    pub fn read_spsr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_spsr_el1__extern"]
    pub fn write_spsr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_spsr_el1__extern"]
    pub fn zero_spsr_el1();
}
extern "C" {
    #[link_name = "read_spsr_el2__extern"]
    pub fn read_spsr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_spsr_el2__extern"]
    pub fn write_spsr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_spsr_el2__extern"]
    pub fn zero_spsr_el2();
}
extern "C" {
    #[link_name = "read_spsr_el3__extern"]
    pub fn read_spsr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_spsr_el3__extern"]
    pub fn write_spsr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_spsr_el3__extern"]
    pub fn zero_spsr_el3();
}
extern "C" {
    #[link_name = "read_tcr_el1__extern"]
    pub fn read_tcr_el1() -> u64;
}
extern "C" {
    #[link_name = "write_tcr_el1__extern"]
    pub fn write_tcr_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_tcr_el1__extern"]
    pub fn zero_tcr_el1();
}
extern "C" {
    #[link_name = "read_tcr_el2__extern"]
    pub fn read_tcr_el2() -> u64;
}
extern "C" {
    #[link_name = "write_tcr_el2__extern"]
    pub fn write_tcr_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_tcr_el2__extern"]
    pub fn zero_tcr_el2();
}
extern "C" {
    #[link_name = "read_tcr_el3__extern"]
    pub fn read_tcr_el3() -> u64;
}
extern "C" {
    #[link_name = "write_tcr_el3__extern"]
    pub fn write_tcr_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_tcr_el3__extern"]
    pub fn zero_tcr_el3();
}
extern "C" {
    #[link_name = "read_ttbr0_el1__extern"]
    pub fn read_ttbr0_el1() -> u64;
}
extern "C" {
    #[link_name = "write_ttbr0_el1__extern"]
    pub fn write_ttbr0_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_ttbr0_el1__extern"]
    pub fn zero_ttbr0_el1();
}
extern "C" {
    #[link_name = "read_ttbr0_el2__extern"]
    pub fn read_ttbr0_el2() -> u64;
}
extern "C" {
    #[link_name = "write_ttbr0_el2__extern"]
    pub fn write_ttbr0_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_ttbr0_el2__extern"]
    pub fn zero_ttbr0_el2();
}
extern "C" {
    #[link_name = "read_ttbr0_el3__extern"]
    pub fn read_ttbr0_el3() -> u64;
}
extern "C" {
    #[link_name = "write_ttbr0_el3__extern"]
    pub fn write_ttbr0_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_ttbr0_el3__extern"]
    pub fn zero_ttbr0_el3();
}
extern "C" {
    #[link_name = "read_vbar_el1__extern"]
    pub fn read_vbar_el1() -> u64;
}
extern "C" {
    #[link_name = "write_vbar_el1__extern"]
    pub fn write_vbar_el1(val: u64);
}
extern "C" {
    #[link_name = "zero_vbar_el1__extern"]
    pub fn zero_vbar_el1();
}
extern "C" {
    #[link_name = "read_vbar_el2__extern"]
    pub fn read_vbar_el2() -> u64;
}
extern "C" {
    #[link_name = "write_vbar_el2__extern"]
    pub fn write_vbar_el2(val: u64);
}
extern "C" {
    #[link_name = "zero_vbar_el2__extern"]
    pub fn zero_vbar_el2();
}
extern "C" {
    #[link_name = "read_vbar_el3__extern"]
    pub fn read_vbar_el3() -> u64;
}
extern "C" {
    #[link_name = "write_vbar_el3__extern"]
    pub fn write_vbar_el3(val: u64);
}
extern "C" {
    #[link_name = "zero_vbar_el3__extern"]
    pub fn zero_vbar_el3();
}
extern "C" {
    #[link_name = "enable_debug_exceptions__extern"]
    pub fn enable_debug_exceptions();
}
extern "C" {
    #[link_name = "disable_debug_exceptions__extern"]
    pub fn disable_debug_exceptions();
}
extern "C" {
    #[link_name = "enable_serror_exceptions__extern"]
    pub fn enable_serror_exceptions();
}
extern "C" {
    #[link_name = "disable_serror_exceptions__extern"]
    pub fn disable_serror_exceptions();
}
extern "C" {
    #[link_name = "enable_irq__extern"]
    pub fn enable_irq();
}
extern "C" {
    #[link_name = "disable_irq__extern"]
    pub fn disable_irq();
}
extern "C" {
    #[link_name = "enable_fiq__extern"]
    pub fn enable_fiq();
}
extern "C" {
    #[link_name = "disable_fiq__extern"]
    pub fn disable_fiq();
}
extern "C" {
    #[link_name = "is_el_implemented__extern"]
    pub fn is_el_implemented(el: cty::c_uint) -> bool;
}
extern "C" {
    #[link_name = "is_el_highest_implemented__extern"]
    pub fn is_el_highest_implemented() -> bool;
}
extern "C" {
    #[link_name = "is_el2_sec_supported__extern"]
    pub fn is_el2_sec_supported() -> bool;
}
extern "C" {
    #[link_name = "is_in_secure_state__extern"]
    pub fn is_in_secure_state() -> bool;
}
extern "C" {
    #[link_name = "arch_curr_cpu__extern"]
    pub fn arch_curr_cpu() -> *mut _cpu_t;
}
extern "C" {
    #[link_name = "arch_exception_depth__extern"]
    pub fn arch_exception_depth() -> cty::c_int;
}
extern "C" {
    #[link_name = "arch_proc_id__extern"]
    pub fn arch_proc_id() -> u32;
}
extern "C" {
    pub fn z_arm64_thread_mem_domains_init(thread: *mut k_thread);
}
extern "C" {
    pub fn z_arm64_swap_mem_domains(thread: *mut k_thread);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _callee_saved {
    pub x19: u64,
    pub x20: u64,
    pub x21: u64,
    pub x22: u64,
    pub x23: u64,
    pub x24: u64,
    pub x25: u64,
    pub x26: u64,
    pub x27: u64,
    pub x28: u64,
    pub x29: u64,
    pub sp_el0: u64,
    pub sp_elx: u64,
    pub lr: u64,
}
#[test]
fn bindgen_test_layout__callee_saved() {
    const UNINIT: ::core::mem::MaybeUninit<_callee_saved> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_callee_saved>(),
        112usize,
        concat!("Size of: ", stringify!(_callee_saved))
    );
    assert_eq!(
        ::core::mem::align_of::<_callee_saved>(),
        8usize,
        concat!("Alignment of ", stringify!(_callee_saved))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x19) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x19)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x20) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x21) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x21)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x22) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x22)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x23) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x23)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x24) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x24)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x25) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x25)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x26) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x26)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x27) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x27)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x28) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x29) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(x29)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sp_el0) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(sp_el0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sp_elx) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(sp_elx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lr) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(lr)
        )
    );
}
pub type _callee_saved_t = _callee_saved;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct z_arm64_fp_context {
    pub q0: i128,
    pub q1: i128,
    pub q2: i128,
    pub q3: i128,
    pub q4: i128,
    pub q5: i128,
    pub q6: i128,
    pub q7: i128,
    pub q8: i128,
    pub q9: i128,
    pub q10: i128,
    pub q11: i128,
    pub q12: i128,
    pub q13: i128,
    pub q14: i128,
    pub q15: i128,
    pub q16: i128,
    pub q17: i128,
    pub q18: i128,
    pub q19: i128,
    pub q20: i128,
    pub q21: i128,
    pub q22: i128,
    pub q23: i128,
    pub q24: i128,
    pub q25: i128,
    pub q26: i128,
    pub q27: i128,
    pub q28: i128,
    pub q29: i128,
    pub q30: i128,
    pub q31: i128,
    pub fpsr: u32,
    pub fpcr: u32,
}
#[test]
fn bindgen_test_layout_z_arm64_fp_context() {
    const UNINIT: ::core::mem::MaybeUninit<z_arm64_fp_context> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_arm64_fp_context>(),
        528usize,
        concat!("Size of: ", stringify!(z_arm64_fp_context))
    );
    assert_eq!(
        ::core::mem::align_of::<z_arm64_fp_context>(),
        16usize,
        concat!("Alignment of ", stringify!(z_arm64_fp_context))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q4) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q5) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q6) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q7) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q8) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q9) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q10) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q10)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q11) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q11)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q12) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q12)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q13) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q13)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q14) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q14)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q15) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q15)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q16) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q17) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q17)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q18) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q18)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q19) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q19)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q20) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q20)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q21) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q21)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q22) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q22)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q23) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q23)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q24) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q24)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q25) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q25)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q26) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q26)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q27) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q27)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q28) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q28)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q29) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q29)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q30) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q30)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).q31) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(q31)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpsr) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(fpsr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpcr) as usize - ptr as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_fp_context),
            "::",
            stringify!(fpcr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _thread_arch {
    pub exception_depth: u8,
}
#[test]
fn bindgen_test_layout__thread_arch() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_arch> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_arch>(),
        1usize,
        concat!("Size of: ", stringify!(_thread_arch))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_arch>(),
        1usize,
        concat!("Alignment of ", stringify!(_thread_arch))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exception_depth) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_arch),
            "::",
            stringify!(exception_depth)
        )
    );
}
pub type _thread_arch_t = _thread_arch;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __esf {
    pub x0: u64,
    pub x1: u64,
    pub x2: u64,
    pub x3: u64,
    pub x4: u64,
    pub x5: u64,
    pub x6: u64,
    pub x7: u64,
    pub x8: u64,
    pub x9: u64,
    pub x10: u64,
    pub x11: u64,
    pub x12: u64,
    pub x13: u64,
    pub x14: u64,
    pub x15: u64,
    pub x16: u64,
    pub x17: u64,
    pub x18: u64,
    pub lr: u64,
    pub spsr: u64,
    pub elr: u64,
}
#[test]
fn bindgen_test_layout___esf() {
    const UNINIT: ::core::mem::MaybeUninit<__esf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf>(),
        176usize,
        concat!("Size of: ", stringify!(__esf))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf>(),
        16usize,
        concat!("Alignment of ", stringify!(__esf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x0) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x0))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x2) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x3) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x4) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x5) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x5))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x6) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x6))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x7) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x7))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x8) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x8))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x9) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(x9))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x10) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x11) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x11)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x12) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x12)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x13) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x13)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x14) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x15) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x15)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x16) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x17) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x17)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x18) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lr) as usize - ptr as usize },
        152usize,
        concat!("Offset of field: ", stringify!(__esf), "::", stringify!(lr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).spsr) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(spsr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).elr) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(elr)
        )
    );
}
pub type z_arch_esf_t = __esf;
extern "C" {
    #[doc = " Configure a dynamic interrupt.\n\n Use this instead of IRQ_CONNECT() if arguments cannot be known at build time.\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flags\n\n @return The vector assigned to this interrupt"]
    #[link_name = "irq_connect_dynamic__extern"]
    pub fn irq_connect_dynamic(
        irq: cty::c_uint,
        priority: cty::c_uint,
        routine: ::core::option::Option<unsafe extern "C" fn(parameter: *const cty::c_void)>,
        parameter: *const cty::c_void,
        flags: u32,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " Disconnect a dynamic interrupt.\n\n Use this in conjunction with shared interrupts to remove a routine/parameter\n pair from the list of clients using the same interrupt line. If the interrupt\n is not being shared then the associated _sw_isr_table entry will be replaced\n by (NULL, z_irq_spurious) (default entry).\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flags\n\n @return 0 in case of success, negative value otherwise"]
    #[link_name = "irq_disconnect_dynamic__extern"]
    pub fn irq_disconnect_dynamic(
        irq: cty::c_uint,
        priority: cty::c_uint,
        routine: ::core::option::Option<unsafe extern "C" fn(parameter: *const cty::c_void)>,
        parameter: *const cty::c_void,
        flags: u32,
    ) -> cty::c_int;
}
#[doc = " @brief Initialization function for init entries.\n\n Init entries support both the system initialization and the device\n APIs. Each API has its own init function signature; hence, we have a\n union to cover both."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union init_function {
    #[doc = " System initialization function.\n\n @retval 0 On success\n @retval -errno If init fails."]
    pub sys: ::core::option::Option<unsafe extern "C" fn() -> cty::c_int>,
    #[doc = " Device initialization function.\n\n @param dev Device instance.\n\n @retval 0 On success\n @retval -errno If device initialization fails."]
    pub dev: ::core::option::Option<unsafe extern "C" fn(dev: *const device) -> cty::c_int>,
}
#[test]
fn bindgen_test_layout_init_function() {
    const UNINIT: ::core::mem::MaybeUninit<init_function> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_function>(),
        8usize,
        concat!("Size of: ", stringify!(init_function))
    );
    assert_eq!(
        ::core::mem::align_of::<init_function>(),
        8usize,
        concat!("Alignment of ", stringify!(init_function))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_function),
            "::",
            stringify!(sys)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_function),
            "::",
            stringify!(dev)
        )
    );
}
#[doc = " @brief Structure to store initialization entry information.\n\n @internal\n Init entries need to be defined following these rules:\n\n - Their name must be set using Z_INIT_ENTRY_NAME().\n - They must be placed in a special init section, given by\n   Z_INIT_ENTRY_SECTION().\n - They must be aligned, e.g. using Z_DECL_ALIGN().\n\n See SYS_INIT_NAMED() for an example.\n @endinternal"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct init_entry {
    #[doc = " Initialization function."]
    pub init_fn: init_function,
    pub __bindgen_anon_1: init_entry__bindgen_ty_1,
}
#[doc = " If the init entry belongs to a device, this fields stores a\n reference to it, otherwise it is set to NULL."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union init_entry__bindgen_ty_1 {
    pub dev: *const device,
}
#[test]
fn bindgen_test_layout_init_entry__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<init_entry__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_entry__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(init_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<init_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(init_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_entry__bindgen_ty_1),
            "::",
            stringify!(dev)
        )
    );
}
#[test]
fn bindgen_test_layout_init_entry() {
    const UNINIT: ::core::mem::MaybeUninit<init_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_entry>(),
        16usize,
        concat!("Size of: ", stringify!(init_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<init_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(init_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_fn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_entry),
            "::",
            stringify!(init_fn)
        )
    );
}
extern "C" {
    #[doc = " @brief Check if a physical address is within range of physical memory.\n\n This checks if the physical address (@p virt) is within\n permissible range, e.g. between\n :kconfig:option:`CONFIG_SRAM_BASE_ADDRESS` and\n (:kconfig:option:`CONFIG_SRAM_BASE_ADDRESS` +\n  :kconfig:option:`CONFIG_SRAM_SIZE`).\n\n @note Only used if\n :kconfig:option:`CONFIG_KERNEL_VM_USE_CUSTOM_MEM_RANGE_CHECK`\n is enabled.\n\n @param phys Physical address to be checked.\n\n @return True if physical address is within range, false if not."]
    pub fn sys_mm_is_phys_addr_in_range(phys: usize) -> bool;
}
extern "C" {
    #[doc = " @brief Check if a virtual address is within range of virtual memory.\n\n This checks if the virtual address (@p virt) is within\n permissible range, e.g. between\n :kconfig:option:`CONFIG_KERNEL_VM_BASE` and\n (:kconfig:option:`CONFIG_KERNEL_VM_BASE` +\n  :kconfig:option:`CONFIG_KERNEL_VM_SIZE`).\n\n @note Only used if\n :kconfig:option:`CONFIG_KERNEL_VM_USE_CUSTOM_MEM_RANGE_CHECK`\n is enabled.\n\n @param virt Virtual address to be checked.\n\n @return True if virtual address is within range, false if not."]
    pub fn sys_mm_is_virt_addr_in_range(virt: *mut cty::c_void) -> bool;
}
extern "C" {
    #[link_name = "z_mem_phys_addr__extern"]
    pub fn z_mem_phys_addr(virt: *mut cty::c_void) -> usize;
}
extern "C" {
    #[link_name = "z_mem_virt_addr__extern"]
    pub fn z_mem_virt_addr(phys: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " Map a physical memory region into the kernel's virtual address space\n\n This function is intended for mapping memory-mapped I/O regions into\n the virtual address space. Given a physical address and a size, return a\n linear address representing the base of where the physical region is mapped\n in the virtual address space for the Zephyr kernel.\n\n This function alters the active page tables in the area reserved\n for the kernel. This function will choose the virtual address\n and return it to the caller.\n\n Portable code should never assume that phys_addr and linear_addr will\n be equal.\n\n Caching and access properties are controlled by the 'flags' parameter.\n Unused bits in 'flags' are reserved for future expansion.\n A caching mode must be selected. By default, the region is read-only\n with user access and code execution forbidden. This policy is changed\n by passing K_MEM_CACHE_* and K_MEM_PERM_* macros into the 'flags' parameter.\n\n If there is insufficient virtual address space for the mapping this will\n generate a kernel panic.\n\n This API is only available if CONFIG_MMU is enabled.\n\n It is highly discouraged to use this function to map system RAM page\n frames. It may conflict with anonymous memory mappings and demand paging\n and produce undefined behavior.  Do not use this for RAM unless you know\n exactly what you are doing. If you need a chunk of memory, use k_mem_map().\n If you need a contiguous buffer of physical memory, statically declare it\n and pin it at build time, it will be mapped when the system boots.\n\n This API is part of infrastructure still under development and may\n change.\n\n @param[out] virt Output virtual address storage location\n @param[in]  phys Physical address base of the memory region\n @param[in]  size Size of the memory region\n @param[in]  flags Caching mode and access flags, see K_MAP_* macros"]
    pub fn z_phys_map(virt_ptr: *mut *mut u8, phys: usize, size: usize, flags: u32);
}
extern "C" {
    #[doc = " Unmap a virtual memory region from kernel's virtual address space.\n\n This function is intended to be used by drivers and early boot routines\n where temporary memory mappings need to be made. This allows these\n memory mappings to be discarded once they are no longer needed.\n\n This function alters the active page tables in the area reserved\n for the kernel.\n\n This will align the input parameters to page boundaries so that\n this can be used with the virtual address as returned by\n z_phys_map().\n\n This API is only available if CONFIG_MMU is enabled.\n\n It is highly discouraged to use this function to unmap memory mappings.\n It may conflict with anonymous memory mappings and demand paging and\n produce undefined behavior. Do not use this unless you know exactly\n what you are doing.\n\n This API is part of infrastructure still under development and may\n change.\n\n @param virt Starting address of the virtual address region to be unmapped.\n @param size Size of the virtual address region"]
    pub fn z_phys_unmap(virt: *mut u8, size: usize);
}
extern "C" {
    #[doc = " Return the amount of free memory available\n\n The returned value will reflect how many free RAM page frames are available.\n If demand paging is enabled, it may still be possible to allocate more.\n\n The information reported by this function may go stale immediately if\n concurrent memory mappings or page-ins take place.\n\n @return Free physical RAM, in bytes"]
    pub fn k_mem_free_get() -> usize;
}
extern "C" {
    #[doc = " Map anonymous memory into Zephyr's address space\n\n This function effectively increases the data space available to Zephyr.\n The kernel will choose a base virtual address and return it to the caller.\n The memory will have access permissions for all contexts set per the\n provided flags argument.\n\n If user thread access control needs to be managed in any way, do not enable\n K_MEM_PERM_USER flags here; instead manage the region's permissions\n with memory domain APIs after the mapping has been established. Setting\n K_MEM_PERM_USER here will allow all user threads to access this memory\n which is usually undesirable.\n\n Unless K_MEM_MAP_UNINIT is used, the returned memory will be zeroed.\n\n The mapped region is not guaranteed to be physically contiguous in memory.\n Physically contiguous buffers should be allocated statically and pinned\n at build time.\n\n Pages mapped in this way have write-back cache settings.\n\n The returned virtual memory pointer will be page-aligned. The size\n parameter, and any base address for re-mapping purposes must be page-\n aligned.\n\n Note that the allocation includes two guard pages immediately before\n and after the requested region. The total size of the allocation will be\n the requested size plus the size of these two guard pages.\n\n Many K_MEM_MAP_* flags have been implemented to alter the behavior of this\n function, with details in the documentation for these flags.\n\n @param size Size of the memory mapping. This must be page-aligned.\n @param flags K_MEM_PERM_*, K_MEM_MAP_* control flags.\n @return The mapped memory location, or NULL if insufficient virtual address\n         space, insufficient physical memory to establish the mapping,\n         or insufficient memory for paging structures."]
    pub fn k_mem_map(size: usize, flags: u32) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " Un-map mapped memory\n\n This removes a memory mapping for the provided page-aligned region.\n Associated page frames will be free and the kernel may re-use the associated\n virtual address region. Any paged out data pages may be discarded.\n\n Calling this function on a region which was not mapped to begin with is\n undefined behavior.\n\n @param addr Page-aligned memory region base virtual address\n @param size Page-aligned memory region size"]
    pub fn k_mem_unmap(addr: *mut cty::c_void, size: usize);
}
extern "C" {
    #[doc = " Given an arbitrary region, provide a aligned region that covers it\n\n The returned region will have both its base address and size aligned\n to the provided alignment value.\n\n @param[out] aligned_addr Aligned address\n @param[out] aligned_size Aligned region size\n @param[in]  addr Region base address\n @param[in]  size Region size\n @param[in]  align What to align the address and size to\n @retval offset between aligned_addr and addr"]
    pub fn k_mem_region_align(
        aligned_addr: *mut usize,
        aligned_size: *mut usize,
        addr: usize,
        size: usize,
        align: usize,
    ) -> usize;
}
pub type io_port_t = u32;
pub type mm_reg_t = usize;
pub type mem_addr_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_device_mmio_rom {
    #[doc = " MMIO linear address"]
    pub addr: mm_reg_t,
}
#[test]
fn bindgen_test_layout_z_device_mmio_rom() {
    const UNINIT: ::core::mem::MaybeUninit<z_device_mmio_rom> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_device_mmio_rom>(),
        8usize,
        concat!("Size of: ", stringify!(z_device_mmio_rom))
    );
    assert_eq!(
        ::core::mem::align_of::<z_device_mmio_rom>(),
        8usize,
        concat!("Alignment of ", stringify!(z_device_mmio_rom))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_device_mmio_rom),
            "::",
            stringify!(addr)
        )
    );
}
#[doc = " @brief Type used to represent a \"handle\" for a device.\n\n Every @ref device has an associated handle. You can get a pointer to a\n @ref device from its handle and vice versa, but the handle uses less space\n than a pointer. The device.h API mainly uses handles to store lists of\n multiple devices in a compact way.\n\n The extreme values and zero have special significance. Negative values\n identify functionality that does not correspond to a Zephyr device, such as\n the system clock or a SYS_INIT() function.\n\n @see device_handle_get()\n @see device_from_handle()"]
pub type device_handle_t = i16;
#[doc = " @brief Runtime device dynamic structure (in RAM) per driver instance\n\n Fields in this are expected to be default-initialized to zero. The\n kernel driver infrastructure and driver access functions are\n responsible for ensuring that any non-zero initialization is done\n before they are accessed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device_state {
    #[doc = " Device initialization return code (positive errno value).\n\n Device initialization functions return a negative errno code if they\n fail. In Zephyr, errno values do not exceed 255, so we can store the\n positive result value in a uint8_t type."]
    pub init_res: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_device_state() {
    const UNINIT: ::core::mem::MaybeUninit<device_state> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<device_state>(),
        2usize,
        concat!("Size of: ", stringify!(device_state))
    );
    assert_eq!(
        ::core::mem::align_of::<device_state>(),
        1usize,
        concat!("Alignment of ", stringify!(device_state))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_res) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device_state),
            "::",
            stringify!(init_res)
        )
    );
}
impl device_state {
    #[inline]
    pub fn initialized(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_initialized(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(initialized: bool) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let initialized: u8 = unsafe { ::core::mem::transmute(initialized) };
            initialized as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pm_device {
    _unused: [u8; 0],
}
#[doc = " @defgroup sys_init System Initialization\n @ingroup os_services\n\n Zephyr offers an infrastructure to call initialization code before `main`.\n Such initialization calls can be registered using SYS_INIT() or\n SYS_INIT_NAMED() macros. By using a combination of initialization levels and\n priorities init sequence can be adjusted as needed. The available\n initialization levels are described, in order, below:\n\n - `EARLY`: Used very early in the boot process, right after entering the C\n   domain (``z_cstart()``). This can be used in architectures and SoCs that\n   extend or implement architecture code and use drivers or system services\n   that have to be initialized before the Kernel calls any architecture\n   specific initialization code.\n - `PRE_KERNEL_1`: Executed in Kernel's initialization context, which uses\n   the interrupt stack. At this point Kernel services are not yet available.\n - `PRE_KERNEL_2`: Same as `PRE_KERNEL_1`.\n - `POST_KERNEL`: Executed after Kernel is alive. From this point on, Kernel\n   primitives can be used.\n - `APPLICATION`: Executed just before application code (`main`).\n - `SMP`: Only available if @kconfig{CONFIG_SMP} is enabled, specific for\n   SMP.\n\n Initialization priority can take a value in the range of 0 to 99.\n\n @note The same infrastructure is used by devices.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device {
    #[doc = " Name of the device instance"]
    pub name: *const cty::c_char,
    #[doc = " Address of device instance config information"]
    pub config: *const cty::c_void,
    #[doc = " Address of the API structure exposed by the device instance"]
    pub api: *const cty::c_void,
    #[doc = " Address of the common device state"]
    pub state: *mut device_state,
    #[doc = " Address of the device instance private data"]
    pub data: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_device() {
    const UNINIT: ::core::mem::MaybeUninit<device> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<device>(),
        40usize,
        concat!("Size of: ", stringify!(device))
    );
    assert_eq!(
        ::core::mem::align_of::<device>(),
        8usize,
        concat!("Alignment of ", stringify!(device))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).api) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(api)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " @brief Get the handle for a given device\n\n @param dev the device for which a handle is desired.\n\n @return the handle for the device, or DEVICE_HANDLE_NULL if the device does\n not have an associated handle."]
    #[link_name = "device_handle_get__extern"]
    pub fn device_handle_get(dev: *const device) -> device_handle_t;
}
extern "C" {
    #[doc = " @brief Get the device corresponding to a handle.\n\n @param dev_handle the device handle\n\n @return the device that has that handle, or a null pointer if @p dev_handle\n does not identify a device."]
    #[link_name = "device_from_handle__extern"]
    pub fn device_from_handle(dev_handle: device_handle_t) -> *const device;
}
extern "C" {
    #[doc = " @brief Get a @ref device reference from its @ref device.name field.\n\n This function iterates through the devices on the system. If a device with\n the given @p name field is found, and that device initialized successfully at\n boot time, this function returns a pointer to the device.\n\n If no device has the given @p name, this function returns `NULL`.\n\n This function also returns NULL when a device is found, but it failed to\n initialize successfully at boot time. (To troubleshoot this case, set a\n breakpoint on your device driver's initialization function.)\n\n @param name device name to search for. A null pointer, or a pointer to an\n empty string, will cause NULL to be returned.\n\n @return pointer to device structure with the given name; `NULL` if the device\n is not found or if the device with that name's initialization function\n failed."]
    #[link_name = "device_get_binding__extern"]
    pub fn device_get_binding(name: *const cty::c_char) -> *const device;
}
extern "C" {
    #[doc = " @brief Get access to the static array of static devices.\n\n @param devices where to store the pointer to the array of statically\n allocated devices. The array must not be mutated through this pointer.\n\n @return the number of statically allocated devices."]
    pub fn z_device_get_all_static(devices: *mut *const device) -> usize;
}
extern "C" {
    #[doc = " @brief Verify that a device is ready for use.\n\n This is the implementation underlying device_is_ready(), without the overhead\n of a syscall wrapper.\n\n @param dev pointer to the device in question.\n\n @retval true If the device is ready for use.\n @retval false If the device is not ready for use or if a NULL device pointer\n is passed as argument.\n\n @see device_is_ready()"]
    pub fn z_device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    #[doc = " @brief Verify that a device is ready for use.\n\n Indicates whether the provided device pointer is for a device known to be\n in a state where it can be used with its standard API.\n\n This can be used with device pointers captured from DEVICE_DT_GET(), which\n does not include the readiness checks of device_get_binding(). At minimum\n this means that the device has been successfully initialized.\n\n @param dev pointer to the device in question.\n\n @retval true If the device is ready for use.\n @retval false If the device is not ready for use or if a NULL device pointer\n is passed as argument."]
    #[link_name = "device_is_ready__extern"]
    pub fn device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    #[link_name = "z_impl_device_is_ready__extern"]
    pub fn z_impl_device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    pub static __device_dts_ord_0: device;
}
extern "C" {
    pub static __device_dts_ord_2: device;
}
extern "C" {
    pub static __device_dts_ord_1: device;
}
extern "C" {
    pub static __device_dts_ord_3: device;
}
extern "C" {
    pub static __device_dts_ord_14: device;
}
extern "C" {
    pub static __device_dts_ord_4: device;
}
extern "C" {
    pub static __device_dts_ord_8: device;
}
extern "C" {
    pub static __device_dts_ord_9: device;
}
extern "C" {
    pub static __device_dts_ord_10: device;
}
extern "C" {
    pub static __device_dts_ord_15: device;
}
extern "C" {
    pub static __device_dts_ord_6: device;
}
extern "C" {
    pub static __device_dts_ord_7: device;
}
extern "C" {
    pub static __device_dts_ord_5: device;
}
extern "C" {
    pub static __device_dts_ord_11: device;
}
extern "C" {
    pub static __device_dts_ord_13: device;
}
extern "C" {
    pub static __device_dts_ord_12: device;
}
extern "C" {
    pub fn z_impl_device_get_binding(name: *const cty::c_char) -> *const device;
}
extern "C" {
    pub fn _isr_wrapper();
}
extern "C" {
    pub fn z_irq_spurious(unused: *const cty::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_table_entry {
    pub arg: *const cty::c_void,
    pub isr: ::core::option::Option<unsafe extern "C" fn(arg1: *const cty::c_void)>,
}
#[test]
fn bindgen_test_layout__isr_table_entry() {
    const UNINIT: ::core::mem::MaybeUninit<_isr_table_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_isr_table_entry>(),
        16usize,
        concat!("Size of: ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_table_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).isr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(isr)
        )
    );
}
extern "C" {
    pub static mut _sw_isr_table: [_isr_table_entry; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _irq_parent_entry {
    pub dev: *const device,
    pub irq: cty::c_uint,
    pub offset: cty::c_uint,
}
#[test]
fn bindgen_test_layout__irq_parent_entry() {
    const UNINIT: ::core::mem::MaybeUninit<_irq_parent_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_irq_parent_entry>(),
        16usize,
        concat!("Size of: ", stringify!(_irq_parent_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<_irq_parent_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_irq_parent_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_list {
    #[doc = " IRQ line number"]
    pub irq: i32,
    #[doc = " Flags for this IRQ, see ISR_FLAG_* definitions"]
    pub flags: i32,
    #[doc = " ISR to call"]
    pub func: *mut cty::c_void,
    #[doc = " Parameter for non-direct IRQs"]
    pub param: *const cty::c_void,
}
#[test]
fn bindgen_test_layout__isr_list() {
    const UNINIT: ::core::mem::MaybeUninit<_isr_list> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_isr_list>(),
        24usize,
        concat!("Size of: ", stringify!(_isr_list))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_list>(),
        8usize,
        concat!("Alignment of ", stringify!(_isr_list))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).param) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(param)
        )
    );
}
extern "C" {
    pub fn z_arm64_irq_priority_set(irq: cty::c_uint, prio: cty::c_uint, flags: u32);
}
extern "C" {
    pub fn z_arm64_interrupt_init();
}
extern "C" {
    pub fn sys_clock_cycle_get_32() -> u32;
}
extern "C" {
    pub fn sys_clock_cycle_get_64() -> u64;
}
extern "C" {
    #[link_name = "arch_nop__extern"]
    pub fn arch_nop();
}
extern "C" {
    #[doc = " @brief Full/sequentially-consistent data memory barrier.\n\n This routine acts as a synchronization fence between threads and prevents\n re-ordering of data accesses instructions across the barrier instruction."]
    #[link_name = "barrier_dmem_fence_full__extern"]
    pub fn barrier_dmem_fence_full();
}
extern "C" {
    #[doc = " @brief Full/sequentially-consistent data synchronization barrier.\n\n This routine acts as a synchronization fence between threads and prevents\n re-ordering of data accesses instructions across the barrier instruction\n like @ref barrier_dmem_fence_full(), but has the additional effect of\n blocking execution of any further instructions, not just loads or stores, or\n both, until synchronization is complete.\n\n @note When not supported by hardware or architecture, this instruction falls\n back to a full/sequentially-consistent data memory barrier."]
    #[link_name = "barrier_dsync_fence_full__extern"]
    pub fn barrier_dsync_fence_full();
}
extern "C" {
    #[doc = " @brief Full/sequentially-consistent instruction synchronization barrier.\n\n This routine is used to guarantee that any subsequent instructions are\n fetched and to ensure any previously executed context-changing operations,\n such as writes to system control registers, have completed by the time the\n routine completes. In hardware terms, this might mean that the instruction\n pipeline is flushed, for example.\n\n @note When not supported by hardware or architecture, this instruction falls\n back to a compiler barrier."]
    #[link_name = "barrier_isync_fence_full__extern"]
    pub fn barrier_isync_fence_full();
}
extern "C" {
    #[link_name = "sys_read8__extern"]
    pub fn sys_read8(addr: mem_addr_t) -> u8;
}
extern "C" {
    #[link_name = "sys_write8__extern"]
    pub fn sys_write8(data: u8, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read16__extern"]
    pub fn sys_read16(addr: mem_addr_t) -> u16;
}
extern "C" {
    #[link_name = "sys_write16__extern"]
    pub fn sys_write16(data: u16, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read32__extern"]
    pub fn sys_read32(addr: mem_addr_t) -> u32;
}
extern "C" {
    #[link_name = "sys_write32__extern"]
    pub fn sys_write32(data: u32, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read64__extern"]
    pub fn sys_read64(addr: mem_addr_t) -> u64;
}
extern "C" {
    #[link_name = "sys_write64__extern"]
    pub fn sys_write64(data: u64, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "arm_arch_timer_init__extern"]
    pub fn arm_arch_timer_init();
}
extern "C" {
    #[link_name = "arm_arch_timer_set_compare__extern"]
    pub fn arm_arch_timer_set_compare(val: u64);
}
extern "C" {
    #[link_name = "arm_arch_timer_enable__extern"]
    pub fn arm_arch_timer_enable(enable: cty::c_uchar);
}
extern "C" {
    #[link_name = "arm_arch_timer_set_irq_mask__extern"]
    pub fn arm_arch_timer_set_irq_mask(mask: bool);
}
extern "C" {
    #[link_name = "arm_arch_timer_count__extern"]
    pub fn arm_arch_timer_count() -> u64;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct z_arm64_thread_stack_header {
    pub privilege_stack: [cty::c_char; 1usize],
}
#[test]
fn bindgen_test_layout_z_arm64_thread_stack_header() {
    const UNINIT: ::core::mem::MaybeUninit<z_arm64_thread_stack_header> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_arm64_thread_stack_header>(),
        16usize,
        concat!("Size of: ", stringify!(z_arm64_thread_stack_header))
    );
    assert_eq!(
        ::core::mem::align_of::<z_arm64_thread_stack_header>(),
        16usize,
        concat!("Alignment of ", stringify!(z_arm64_thread_stack_header))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).privilege_stack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_arm64_thread_stack_header),
            "::",
            stringify!(privilege_stack)
        )
    );
}
pub type paddr_t = usize;
pub type vaddr_t = *mut cty::c_void;
extern "C" {
    #[link_name = "sys_set_bit__extern"]
    pub fn sys_set_bit(addr: mem_addr_t, bit: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_clear_bit__extern"]
    pub fn sys_clear_bit(addr: mem_addr_t, bit: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_test_bit__extern"]
    pub fn sys_test_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[link_name = "sys_set_bits__extern"]
    pub fn sys_set_bits(addr: mem_addr_t, mask: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_clear_bits__extern"]
    pub fn sys_clear_bits(addr: mem_addr_t, mask: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_set_bit__extern"]
    pub fn sys_bitfield_set_bit(addr: mem_addr_t, bit: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_clear_bit__extern"]
    pub fn sys_bitfield_clear_bit(addr: mem_addr_t, bit: cty::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_test_bit__extern"]
    pub fn sys_bitfield_test_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[link_name = "sys_test_and_set_bit__extern"]
    pub fn sys_test_and_set_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[link_name = "sys_test_and_clear_bit__extern"]
    pub fn sys_test_and_clear_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[link_name = "sys_bitfield_test_and_set_bit__extern"]
    pub fn sys_bitfield_test_and_set_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[link_name = "sys_bitfield_test_and_clear_bit__extern"]
    pub fn sys_bitfield_test_and_clear_bit(addr: mem_addr_t, bit: cty::c_uint) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief find most significant bit set in a 32-bit word\n\n This routine finds the first bit set starting from the most significant bit\n in the argument passed in and returns the index of that bit.  Bits are\n numbered starting at 1 from the least significant bit.  A return value of\n zero indicates that the value passed is zero.\n\n @return most significant bit set, 0 if @a op is 0"]
    #[link_name = "find_msb_set__extern"]
    pub fn find_msb_set(op: u32) -> cty::c_uint;
}
extern "C" {
    #[doc = " @brief find least significant bit set in a 32-bit word\n\n This routine finds the first bit set starting from the least significant bit\n in the argument passed in and returns the index of that bit.  Bits are\n numbered starting at 1 from the least significant bit.  A return value of\n zero indicates that the value passed is zero.\n\n @return least significant bit set, 0 if @a op is 0"]
    #[link_name = "find_lsb_set__extern"]
    pub fn find_lsb_set(op: u32) -> cty::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_mem_domain {
    pub node: sys_snode_t,
}
#[test]
fn bindgen_test_layout_arch_mem_domain() {
    const UNINIT: ::core::mem::MaybeUninit<arch_mem_domain> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<arch_mem_domain>(),
        8usize,
        concat!("Size of: ", stringify!(arch_mem_domain))
    );
    assert_eq!(
        ::core::mem::align_of::<arch_mem_domain>(),
        8usize,
        concat!("Alignment of ", stringify!(arch_mem_domain))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_mem_domain),
            "::",
            stringify!(node)
        )
    );
}
pub type k_ticks_t = u32;
#[doc = " @brief Kernel timeout type\n\n Timeout arguments presented to kernel APIs are stored in this\n opaque type, which is capable of representing times in various\n formats and units.  It should be constructed from application data\n using one of the macros defined for this purpose (e.g. `K_MSEC()`,\n `K_TIMEOUT_ABS_TICKS()`, etc...), or be one of the two constants\n K_NO_WAIT or K_FOREVER.  Applications should not inspect the\n internal data once constructed.  Timeout values may be compared for\n equality with the `K_TIMEOUT_EQ()` macro."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_timeout_t {
    pub ticks: k_ticks_t,
}
#[test]
fn bindgen_test_layout_k_timeout_t() {
    const UNINIT: ::core::mem::MaybeUninit<k_timeout_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_timeout_t>(),
        4usize,
        concat!("Size of: ", stringify!(k_timeout_t))
    );
    assert_eq!(
        ::core::mem::align_of::<k_timeout_t>(),
        4usize,
        concat!("Alignment of ", stringify!(k_timeout_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ticks) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timeout_t),
            "::",
            stringify!(ticks)
        )
    );
}
extern "C" {
    #[doc = " @brief Return the lower part of the current system tick count\n\n @return the current system tick count\n"]
    pub fn sys_clock_tick_get_32() -> u32;
}
extern "C" {
    #[doc = " @brief Return the current system tick count\n\n @return the current system tick count\n"]
    pub fn sys_clock_tick_get() -> i64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_timepoint_t {
    pub wait: bool,
}
#[test]
fn bindgen_test_layout_k_timepoint_t() {
    const UNINIT: ::core::mem::MaybeUninit<k_timepoint_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_timepoint_t>(),
        1usize,
        concat!("Size of: ", stringify!(k_timepoint_t))
    );
    assert_eq!(
        ::core::mem::align_of::<k_timepoint_t>(),
        1usize,
        concat!("Alignment of ", stringify!(k_timepoint_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wait) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timepoint_t),
            "::",
            stringify!(wait)
        )
    );
}
extern "C" {
    #[link_name = "sys_timepoint_calc__extern"]
    pub fn sys_timepoint_calc(timeout: k_timeout_t) -> k_timepoint_t;
}
extern "C" {
    #[link_name = "sys_timepoint_timeout__extern"]
    pub fn sys_timepoint_timeout(timepoint: k_timepoint_t) -> k_timeout_t;
}
extern "C" {
    #[link_name = "sys_timepoint_cmp__extern"]
    pub fn sys_timepoint_cmp(a: k_timepoint_t, b: k_timepoint_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Indicates if timepoint is expired\n\n @param timepoint Timepoint to evaluate\n @retval true if the timepoint is in the past, false otherwise\n\n @see sys_timepoint_calc()"]
    #[link_name = "sys_timepoint_expired__extern"]
    pub fn sys_timepoint_expired(timepoint: k_timepoint_t) -> bool;
}
extern "C" {
    pub fn __errno_location() -> *mut cty::c_int;
}
#[doc = " @brief Spinlock APIs\n @defgroup spinlock_apis Spinlock APIs\n @ingroup kernel_apis\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_spinlock_key {
    pub key: cty::c_int,
}
#[test]
fn bindgen_test_layout_z_spinlock_key() {
    const UNINIT: ::core::mem::MaybeUninit<z_spinlock_key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_spinlock_key>(),
        4usize,
        concat!("Size of: ", stringify!(z_spinlock_key))
    );
    assert_eq!(
        ::core::mem::align_of::<z_spinlock_key>(),
        4usize,
        concat!("Alignment of ", stringify!(z_spinlock_key))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_spinlock_key),
            "::",
            stringify!(key)
        )
    );
}
#[doc = " @brief Kernel Spin Lock\n\n This struct defines a spin lock record on which CPUs can wait with\n k_spin_lock().  Any number of spinlocks may be defined in\n application code."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_spinlock {
    is_empty: bool
}
#[test]
fn bindgen_test_layout_k_spinlock() {
    assert_eq!(
        ::core::mem::size_of::<k_spinlock>(),
        0usize,
        concat!("Size of: ", stringify!(k_spinlock))
    );
    assert_eq!(
        ::core::mem::align_of::<k_spinlock>(),
        1usize,
        concat!("Alignment of ", stringify!(k_spinlock))
    );
}
#[doc = " @brief Spinlock key type\n\n This type defines a \"key\" value used by a spinlock implementation\n to store the system interrupt state at the time of a call to\n k_spin_lock().  It is expected to be passed to a matching\n k_spin_unlock().\n\n This type is opaque and should not be inspected by application\n code."]
pub type k_spinlock_key_t = z_spinlock_key;
extern "C" {
    #[link_name = "z_spinlock_validate_pre__extern"]
    pub fn z_spinlock_validate_pre(l: *mut k_spinlock);
}
extern "C" {
    #[link_name = "z_spinlock_validate_post__extern"]
    pub fn z_spinlock_validate_post(l: *mut k_spinlock);
}
extern "C" {
    #[doc = " @brief Lock a spinlock\n\n This routine locks the specified spinlock, returning a key handle\n representing interrupt state needed at unlock time.  Upon\n returning, the calling thread is guaranteed not to be suspended or\n interrupted on its current CPU until it calls k_spin_unlock().  The\n implementation guarantees mutual exclusion: exactly one thread on\n one CPU will return from k_spin_lock() at a time.  Other CPUs\n trying to acquire a lock already held by another CPU will enter an\n implementation-defined busy loop (\"spinning\") until the lock is\n released.\n\n Separate spin locks may be nested. It is legal to lock an\n (unlocked) spin lock while holding a different lock.  Spin locks\n are not recursive, however: an attempt to acquire a spin lock that\n the CPU already holds will deadlock.\n\n In circumstances where only one CPU exists, the behavior of\n k_spin_lock() remains as specified above, though obviously no\n spinning will take place.  Implementations may be free to optimize\n in uniprocessor contexts such that the locking reduces to an\n interrupt mask operation.\n\n @param l A pointer to the spinlock to lock\n @return A key value that must be passed to k_spin_unlock() when the\n         lock is released."]
    #[link_name = "k_spin_lock__extern"]
    pub fn k_spin_lock(l: *mut k_spinlock) -> k_spinlock_key_t;
}
extern "C" {
    #[doc = " @brief Attempt to lock a spinlock\n\n This routine makes one attempt to lock @p l. If it is successful, then\n it will store the key into @p k.\n\n @param[in] l A pointer to the spinlock to lock\n @param[out] k A pointer to the spinlock key\n @retval 0 on success\n @retval -EBUSY if another thread holds the lock\n\n @see k_spin_lock\n @see k_spin_unlock"]
    #[link_name = "k_spin_trylock__extern"]
    pub fn k_spin_trylock(l: *mut k_spinlock, k: *mut k_spinlock_key_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Unlock a spin lock\n\n This releases a lock acquired by k_spin_lock().  After this\n function is called, any CPU will be able to acquire the lock.  If\n other CPUs are currently spinning inside k_spin_lock() waiting for\n this lock, exactly one of them will return synchronously with the\n lock held.\n\n Spin locks must be properly nested.  A call to k_spin_unlock() must\n be made on the lock object most recently locked using\n k_spin_lock(), using the key value that it returned.  Attempts to\n unlock mis-nested locks, or to unlock locks that are not held, or\n to passing a key parameter other than the one returned from\n k_spin_lock(), are illegal.  When CONFIG_SPIN_VALIDATE is set, some\n of these errors can be detected by the framework.\n\n @param l A pointer to the spinlock to release\n @param key The value returned from k_spin_lock() when this lock was\n        acquired"]
    #[link_name = "k_spin_unlock__extern"]
    pub fn k_spin_unlock(l: *mut k_spinlock, key: k_spinlock_key_t);
}
extern "C" {
    #[link_name = "k_spin_release__extern"]
    pub fn k_spin_release(l: *mut k_spinlock);
}
#[doc = " Generic CPU exception, not covered by other codes"]
pub const k_fatal_error_reason_K_ERR_CPU_EXCEPTION: k_fatal_error_reason = 0;
#[doc = " Unhandled hardware interrupt"]
pub const k_fatal_error_reason_K_ERR_SPURIOUS_IRQ: k_fatal_error_reason = 1;
#[doc = " Faulting context overflowed its stack buffer"]
pub const k_fatal_error_reason_K_ERR_STACK_CHK_FAIL: k_fatal_error_reason = 2;
#[doc = " Moderate severity software error"]
pub const k_fatal_error_reason_K_ERR_KERNEL_OOPS: k_fatal_error_reason = 3;
#[doc = " High severity software error"]
pub const k_fatal_error_reason_K_ERR_KERNEL_PANIC: k_fatal_error_reason = 4;
#[doc = " Arch specific fatal errors"]
pub const k_fatal_error_reason_K_ERR_ARCH_START: k_fatal_error_reason = 16;
#[doc = " @defgroup fatal_types Fatal error base types\n @ingroup fatal_apis\n @{"]
pub type k_fatal_error_reason = cty::c_uint;
extern "C" {
    #[doc = " @brief Halt the system on a fatal error\n\n Invokes architecture-specific code to power off or halt the system in\n a low power state. Lacking that, lock interrupts and sit in an idle loop.\n\n @param reason Fatal exception reason code"]
    pub fn k_fatal_halt(reason: cty::c_uint) -> !;
}
extern "C" {
    #[doc = " @brief Fatal error policy handler\n\n This function is not invoked by application code, but is declared as a\n weak symbol so that applications may introduce their own policy.\n\n The default implementation of this function halts the system\n unconditionally. Depending on architecture support, this may be\n a simple infinite loop, power off the hardware, or exit an emulator.\n\n If this function returns, then the currently executing thread will be\n aborted.\n\n A few notes for custom implementations:\n\n - If the error is determined to be unrecoverable, LOG_PANIC() should be\n   invoked to flush any pending logging buffers.\n - K_ERR_KERNEL_PANIC indicates a severe unrecoverable error in the kernel\n   itself, and should not be considered recoverable. There is an assertion\n   in z_fatal_error() to enforce this.\n - Even outside of a kernel panic, unless the fault occurred in user mode,\n   the kernel itself may be in an inconsistent state, with API calls to\n   kernel objects possibly exhibiting undefined behavior or triggering\n   another exception.\n\n @param reason The reason for the fatal error\n @param esf Exception context, with details and partial or full register\n            state when the error occurred. May in some cases be NULL."]
    pub fn k_sys_fatal_error_handler(reason: cty::c_uint, esf: *const z_arch_esf_t);
}
extern "C" {
    #[doc = " Called by architecture code upon a fatal error.\n\n This function dumps out architecture-agnostic information about the error\n and then makes a policy decision on what to do by invoking\n k_sys_fatal_error_handler().\n\n On architectures where k_thread_abort() never returns, this function\n never returns either.\n\n @param reason The reason for the fatal error\n @param esf Exception context, with details and partial or full register\n            state when the error occurred. May in some cases be NULL."]
    pub fn z_fatal_error(reason: cty::c_uint, esf: *const z_arch_esf_t);
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct z_thread_stack_element {
    pub data: cty::c_char,
}
#[test]
fn bindgen_test_layout_z_thread_stack_element() {
    const UNINIT: ::core::mem::MaybeUninit<z_thread_stack_element> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_thread_stack_element>(),
        1usize,
        concat!("Size of: ", stringify!(z_thread_stack_element))
    );
    assert_eq!(
        ::core::mem::align_of::<z_thread_stack_element>(),
        1usize,
        concat!("Alignment of ", stringify!(z_thread_stack_element))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_thread_stack_element),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " @brief Properly align a CPU stack pointer value\n\n Take the provided value and round it down such that the value is aligned\n to the CPU and ABI requirements. This is not used for any memory protection\n hardware requirements.\n\n @param ptr Proposed stack pointer address\n @return Properly aligned stack pointer address"]
    #[link_name = "z_stack_ptr_align__extern"]
    pub fn z_stack_ptr_align(ptr: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    #[doc = " @}"]
    #[link_name = "Z_KERNEL_STACK_BUFFER__extern"]
    pub fn Z_KERNEL_STACK_BUFFER(sym: *mut k_thread_stack_t) -> *mut cty::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _pipe_desc {
    pub node: sys_dnode_t,
    pub buffer: *mut cty::c_uchar,
    pub bytes_to_xfer: usize,
    pub thread: *mut k_thread,
}
#[test]
fn bindgen_test_layout__pipe_desc() {
    const UNINIT: ::core::mem::MaybeUninit<_pipe_desc> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_pipe_desc>(),
        40usize,
        concat!("Size of: ", stringify!(_pipe_desc))
    );
    assert_eq!(
        ::core::mem::align_of::<_pipe_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(_pipe_desc))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_pipe_desc),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_pipe_desc),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bytes_to_xfer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_pipe_desc),
            "::",
            stringify!(bytes_to_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thread) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_pipe_desc),
            "::",
            stringify!(thread)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _thread_base {
    pub __bindgen_anon_1: _thread_base__bindgen_ty_1,
    pub pended_on: *mut _wait_q_t,
    pub user_options: u8,
    pub thread_state: u8,
    pub __bindgen_anon_2: _thread_base__bindgen_ty_2,
    pub order_key: u32,
    pub swap_data: *mut cty::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _thread_base__bindgen_ty_1 {
    pub qnode_dlist: sys_dnode_t,
    pub qnode_rb: rbnode,
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_base__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(_thread_base__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_thread_base__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qnode_dlist) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_1),
            "::",
            stringify!(qnode_dlist)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qnode_rb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_1),
            "::",
            stringify!(qnode_rb)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _thread_base__bindgen_ty_2 {
    pub __bindgen_anon_1: _thread_base__bindgen_ty_2__bindgen_ty_1,
    pub preempt: u16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _thread_base__bindgen_ty_2__bindgen_ty_1 {
    pub prio: i8,
    pub sched_locked: u8,
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_base__bindgen_ty_2__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_2__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_2__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(prio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sched_locked) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(sched_locked)
        )
    );
}
#[test]
fn bindgen_test_layout__thread_base__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_base__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_base__bindgen_ty_2>(),
        2usize,
        concat!("Size of: ", stringify!(_thread_base__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base__bindgen_ty_2>(),
        2usize,
        concat!("Alignment of ", stringify!(_thread_base__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).preempt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base__bindgen_ty_2),
            "::",
            stringify!(preempt)
        )
    );
}
#[test]
fn bindgen_test_layout__thread_base() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_base> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_base>(),
        40usize,
        concat!("Size of: ", stringify!(_thread_base))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_base>(),
        8usize,
        concat!("Alignment of ", stringify!(_thread_base))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pended_on) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(pended_on)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user_options) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(user_options)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thread_state) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(thread_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).order_key) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(order_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).swap_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_base),
            "::",
            stringify!(swap_data)
        )
    );
}
pub type _thread_base_t = _thread_base;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_thread_runtime_stats {
    is_empty: bool
}
#[test]
fn bindgen_test_layout_k_thread_runtime_stats() {
    assert_eq!(
        ::core::mem::size_of::<k_thread_runtime_stats>(),
        0usize,
        concat!("Size of: ", stringify!(k_thread_runtime_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<k_thread_runtime_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(k_thread_runtime_stats))
    );
}
pub type k_thread_runtime_stats_t = k_thread_runtime_stats;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_poller {
    pub is_polling: bool,
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_z_poller() {
    const UNINIT: ::core::mem::MaybeUninit<z_poller> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_poller>(),
        2usize,
        concat!("Size of: ", stringify!(z_poller))
    );
    assert_eq!(
        ::core::mem::align_of::<z_poller>(),
        1usize,
        concat!("Alignment of ", stringify!(z_poller))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_polling) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_poller),
            "::",
            stringify!(is_polling)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(z_poller),
            "::",
            stringify!(mode)
        )
    );
}
#[doc = " @ingroup thread_apis\n Thread Structure"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_thread {
    pub base: _thread_base,
    #[doc = " defined by the architecture, but all archs need these"]
    pub callee_saved: _callee_saved,
    #[doc = " static thread init data"]
    pub init_data: *mut cty::c_void,
    #[doc = " threads waiting in k_thread_join()"]
    pub join_queue: _wait_q_t,
    #[doc = " resource pool"]
    pub resource_pool: *mut k_heap,
    #[doc = " arch-specifics: must always be at the end"]
    pub arch: _thread_arch,
}
#[test]
fn bindgen_test_layout_k_thread() {
    const UNINIT: ::core::mem::MaybeUninit<k_thread> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_thread>(),
        192usize,
        concat!("Size of: ", stringify!(k_thread))
    );
    assert_eq!(
        ::core::mem::align_of::<k_thread>(),
        8usize,
        concat!("Alignment of ", stringify!(k_thread))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).callee_saved) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(callee_saved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_data) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(init_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).join_queue) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(join_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).resource_pool) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(resource_pool)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arch) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(k_thread),
            "::",
            stringify!(arch)
        )
    );
}
#[doc = " @ingroup thread_apis\n Thread Structure"]
pub type _thread_t = k_thread;
pub type k_tid_t = *mut k_thread;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_partition {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " @brief Initialize a memory domain.\n\n Initialize a memory domain with given name and memory partitions.\n\n See documentation for k_mem_domain_add_partition() for details about\n partition constraints.\n\n Do not call k_mem_domain_init() on the same memory domain more than once,\n doing so is undefined behavior.\n\n @param domain The memory domain to be initialized.\n @param num_parts The number of array items of \"parts\" parameter.\n @param parts An array of pointers to the memory partitions. Can be NULL\n              if num_parts is zero.\n\n @retval 0 if successful\n @retval -EINVAL if invalid parameters supplied\n @retval -ENOMEM if insufficient memory"]
    pub fn k_mem_domain_init(
        domain: *mut k_mem_domain,
        num_parts: u8,
        parts: *mut *mut k_mem_partition,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Add a memory partition into a memory domain.\n\n Add a memory partition into a memory domain. Partitions must conform to\n the following constraints:\n\n - Partitions in the same memory domain may not overlap each other.\n - Partitions must not be defined which expose private kernel\n   data structures or kernel objects.\n - The starting address alignment, and the partition size must conform to\n   the constraints of the underlying memory management hardware, which\n   varies per architecture.\n - Memory domain partitions are only intended to control access to memory\n   from user mode threads.\n - If CONFIG_EXECUTE_XOR_WRITE is enabled, the partition must not allow\n   both writes and execution.\n\n Violating these constraints may lead to CPU exceptions or undefined\n behavior.\n\n @param domain The memory domain to be added a memory partition.\n @param part The memory partition to be added\n\n @retval 0 if successful\n @retval -EINVAL if invalid parameters supplied\n @retval -ENOSPC if no free partition slots available"]
    pub fn k_mem_domain_add_partition(
        domain: *mut k_mem_domain,
        part: *mut k_mem_partition,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Remove a memory partition from a memory domain.\n\n Remove a memory partition from a memory domain.\n\n @param domain The memory domain to be removed a memory partition.\n @param part The memory partition to be removed\n\n @retval 0 if successful\n @retval -EINVAL if invalid parameters supplied\n @retval -ENOENT if no matching partition found"]
    pub fn k_mem_domain_remove_partition(
        domain: *mut k_mem_domain,
        part: *mut k_mem_partition,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Add a thread into a memory domain.\n\n Add a thread into a memory domain. It will be removed from whatever\n memory domain it previously belonged to.\n\n @param domain The memory domain that the thread is going to be added into.\n @param thread ID of thread going to be added into the memory domain.\n\n @return 0 if successful, fails otherwise."]
    pub fn k_mem_domain_add_thread(domain: *mut k_mem_domain, thread: k_tid_t) -> cty::c_int;
}
extern "C" {
    #[link_name = "k_object_init__extern"]
    pub fn k_object_init(obj: *const cty::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_object {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "k_object_create_dynamic_aligned__extern"]
    pub fn k_object_create_dynamic_aligned(align: usize, size: usize) -> *mut k_object;
}
extern "C" {
    #[link_name = "k_object_create_dynamic__extern"]
    pub fn k_object_create_dynamic(size: usize) -> *mut k_object;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_futex_data {
    _unused: [u8; 0],
}
pub const k_objects_K_OBJ_ANY: k_objects = 0;
pub const k_objects_K_OBJ_MEM_SLAB: k_objects = 1;
pub const k_objects_K_OBJ_MSGQ: k_objects = 2;
pub const k_objects_K_OBJ_MUTEX: k_objects = 3;
pub const k_objects_K_OBJ_PIPE: k_objects = 4;
pub const k_objects_K_OBJ_QUEUE: k_objects = 5;
pub const k_objects_K_OBJ_POLL_SIGNAL: k_objects = 6;
pub const k_objects_K_OBJ_SEM: k_objects = 7;
pub const k_objects_K_OBJ_STACK: k_objects = 8;
pub const k_objects_K_OBJ_THREAD: k_objects = 9;
pub const k_objects_K_OBJ_TIMER: k_objects = 10;
pub const k_objects_K_OBJ_THREAD_STACK_ELEMENT: k_objects = 11;
pub const k_objects_K_OBJ_NET_SOCKET: k_objects = 12;
pub const k_objects_K_OBJ_NET_IF: k_objects = 13;
pub const k_objects_K_OBJ_SYS_MUTEX: k_objects = 14;
pub const k_objects_K_OBJ_FUTEX: k_objects = 15;
pub const k_objects_K_OBJ_CONDVAR: k_objects = 16;
pub const k_objects_K_OBJ_DRIVER_GPIO: k_objects = 17;
pub const k_objects_K_OBJ_DRIVER_UART: k_objects = 18;
pub const k_objects_K_OBJ_DRIVER_CRYPTO: k_objects = 19;
pub const k_objects_K_OBJ_DRIVER_ADC: k_objects = 20;
pub const k_objects_K_OBJ_DRIVER_AUXDISPLAY: k_objects = 21;
pub const k_objects_K_OBJ_DRIVER_BBRAM: k_objects = 22;
pub const k_objects_K_OBJ_DRIVER_CAN: k_objects = 23;
pub const k_objects_K_OBJ_DRIVER_CHARGER: k_objects = 24;
pub const k_objects_K_OBJ_DRIVER_COREDUMP: k_objects = 25;
pub const k_objects_K_OBJ_DRIVER_COUNTER: k_objects = 26;
pub const k_objects_K_OBJ_DRIVER_DAC: k_objects = 27;
pub const k_objects_K_OBJ_DRIVER_DAI: k_objects = 28;
pub const k_objects_K_OBJ_DRIVER_DMA: k_objects = 29;
pub const k_objects_K_OBJ_DRIVER_EDAC: k_objects = 30;
pub const k_objects_K_OBJ_DRIVER_EEPROM: k_objects = 31;
pub const k_objects_K_OBJ_DRIVER_FUEL_GAUGE_EMUL: k_objects = 32;
pub const k_objects_K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API: k_objects = 33;
pub const k_objects_K_OBJ_DRIVER_ENTROPY: k_objects = 34;
pub const k_objects_K_OBJ_DRIVER_ESPI: k_objects = 35;
pub const k_objects_K_OBJ_DRIVER_ESPI_SAF: k_objects = 36;
pub const k_objects_K_OBJ_DRIVER_FLASH: k_objects = 37;
pub const k_objects_K_OBJ_DRIVER_FPGA: k_objects = 38;
pub const k_objects_K_OBJ_DRIVER_FUEL_GAUGE: k_objects = 39;
pub const k_objects_K_OBJ_DRIVER_GNSS: k_objects = 40;
pub const k_objects_K_OBJ_DRIVER_HWSPINLOCK: k_objects = 41;
pub const k_objects_K_OBJ_DRIVER_I2C: k_objects = 42;
pub const k_objects_K_OBJ_DRIVER_I2S: k_objects = 43;
pub const k_objects_K_OBJ_DRIVER_I3C: k_objects = 44;
pub const k_objects_K_OBJ_DRIVER_IPM: k_objects = 45;
pub const k_objects_K_OBJ_DRIVER_KSCAN: k_objects = 46;
pub const k_objects_K_OBJ_DRIVER_LED: k_objects = 47;
pub const k_objects_K_OBJ_DRIVER_MBOX: k_objects = 48;
pub const k_objects_K_OBJ_DRIVER_MDIO: k_objects = 49;
pub const k_objects_K_OBJ_DRIVER_MIPI_DSI: k_objects = 50;
pub const k_objects_K_OBJ_DRIVER_PECI: k_objects = 51;
pub const k_objects_K_OBJ_DRIVER_PS2: k_objects = 52;
pub const k_objects_K_OBJ_DRIVER_PTP_CLOCK: k_objects = 53;
pub const k_objects_K_OBJ_DRIVER_PWM: k_objects = 54;
pub const k_objects_K_OBJ_DRIVER_REGULATOR_PARENT: k_objects = 55;
pub const k_objects_K_OBJ_DRIVER_REGULATOR: k_objects = 56;
pub const k_objects_K_OBJ_DRIVER_RESET: k_objects = 57;
pub const k_objects_K_OBJ_DRIVER_RETAINED_MEM: k_objects = 58;
pub const k_objects_K_OBJ_DRIVER_RTC: k_objects = 59;
pub const k_objects_K_OBJ_DRIVER_SDHC: k_objects = 60;
pub const k_objects_K_OBJ_DRIVER_SENSOR: k_objects = 61;
pub const k_objects_K_OBJ_DRIVER_SMBUS: k_objects = 62;
pub const k_objects_K_OBJ_DRIVER_SPI: k_objects = 63;
pub const k_objects_K_OBJ_DRIVER_SYSCON: k_objects = 64;
pub const k_objects_K_OBJ_DRIVER_W1: k_objects = 65;
pub const k_objects_K_OBJ_DRIVER_WDT: k_objects = 66;
pub const k_objects_K_OBJ_DRIVER_CAN_TRANSCEIVER: k_objects = 67;
pub const k_objects_K_OBJ_DRIVER_UART_MUX: k_objects = 68;
pub const k_objects_K_OBJ_DRIVER_ITS: k_objects = 69;
pub const k_objects_K_OBJ_DRIVER_TGPIO: k_objects = 70;
pub const k_objects_K_OBJ_DRIVER_PCIE_CTRL: k_objects = 71;
pub const k_objects_K_OBJ_DRIVER_SVC: k_objects = 72;
pub const k_objects_K_OBJ_DRIVER_BC12_EMUL: k_objects = 73;
pub const k_objects_K_OBJ_DRIVER_BC12: k_objects = 74;
pub const k_objects_K_OBJ_DRIVER_TCPC: k_objects = 75;
pub const k_objects_K_OBJ_DRIVER_IVSHMEM: k_objects = 76;
pub const k_objects_K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API: k_objects = 77;
pub const k_objects_K_OBJ_DRIVER_ETHPHY: k_objects = 78;
#[doc = " @endcond"]
pub const k_objects_K_OBJ_LAST: k_objects = 79;
#[doc = " @brief Kernel Object Types\n\n This enumeration needs to be kept in sync with the lists of kernel objects\n and subsystems in scripts/build/gen_kobject_list.py, as well as the otype_to_str()\n function in kernel/userspace.c"]
pub type k_objects = cty::c_uint;
extern "C" {
    #[doc = " @internal"]
    #[link_name = "z_impl_k_object_access_grant__extern"]
    pub fn z_impl_k_object_access_grant(object: *const cty::c_void, thread: *mut k_thread);
}
extern "C" {
    #[doc = " @internal"]
    #[link_name = "k_object_access_revoke__extern"]
    pub fn k_object_access_revoke(object: *const cty::c_void, thread: *mut k_thread);
}
extern "C" {
    #[doc = " @internal"]
    #[link_name = "z_impl_k_object_release__extern"]
    pub fn z_impl_k_object_release(object: *const cty::c_void);
}
extern "C" {
    #[link_name = "k_object_access_all_grant__extern"]
    pub fn k_object_access_all_grant(object: *const cty::c_void);
}
extern "C" {
    #[link_name = "k_object_is_valid__extern"]
    pub fn k_object_is_valid(obj: *const cty::c_void, otype: k_objects) -> bool;
}
extern "C" {
    #[link_name = "z_impl_k_object_alloc__extern"]
    pub fn z_impl_k_object_alloc(otype: k_objects) -> *mut cty::c_void;
}
extern "C" {
    #[link_name = "z_impl_k_object_alloc_size__extern"]
    pub fn z_impl_k_object_alloc_size(otype: k_objects, size: usize) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Free an object\n\n @param obj"]
    #[link_name = "k_object_free__extern"]
    pub fn k_object_free(obj: *mut cty::c_void);
}
extern "C" {
    #[link_name = "k_object_access_grant__extern"]
    pub fn k_object_access_grant(object: *const cty::c_void, thread: *mut k_thread);
}
extern "C" {
    #[link_name = "k_object_release__extern"]
    pub fn k_object_release(object: *const cty::c_void);
}
extern "C" {
    #[link_name = "k_object_alloc__extern"]
    pub fn k_object_alloc(otype: k_objects) -> *mut cty::c_void;
}
extern "C" {
    #[link_name = "k_object_alloc_size__extern"]
    pub fn k_object_alloc_size(otype: k_objects, size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn z_init_cpu(id: cty::c_int);
}
extern "C" {
    pub fn z_sched_ipi();
}
extern "C" {
    pub fn z_smp_start_cpu(id: cty::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_futex {
    _unused: [u8; 0],
}
pub const execution_context_types_K_ISR: execution_context_types = 0;
pub const execution_context_types_K_COOP_THREAD: execution_context_types = 1;
pub const execution_context_types_K_PREEMPT_THREAD: execution_context_types = 2;
pub type execution_context_types = cty::c_uint;
pub type _poller_cb_t = ::core::option::Option<
    unsafe extern "C" fn(event: *mut k_poll_event, state: u32) -> cty::c_int,
>;
#[doc = " @addtogroup thread_apis\n @{"]
pub type k_thread_user_cb_t = ::core::option::Option<
    unsafe extern "C" fn(thread: *const k_thread, user_data: *mut cty::c_void),
>;
extern "C" {
    #[doc = " @brief Iterate over all the threads in the system.\n\n This routine iterates over all the threads in the system and\n calls the user_cb function for each thread.\n\n @param user_cb Pointer to the user callback function.\n @param user_data Pointer to user data.\n\n @note @kconfig{CONFIG_THREAD_MONITOR} must be set for this function\n to be effective.\n @note This API uses @ref k_spin_lock to protect the _kernel.threads\n list which means creation of new threads and terminations of existing\n threads are blocked until this API returns."]
    pub fn k_thread_foreach(user_cb: k_thread_user_cb_t, user_data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Iterate over all the threads in the system without locking.\n\n This routine works exactly the same like @ref k_thread_foreach\n but unlocks interrupts when user_cb is executed.\n\n @param user_cb Pointer to the user callback function.\n @param user_data Pointer to user data.\n\n @note @kconfig{CONFIG_THREAD_MONITOR} must be set for this function\n to be effective.\n @note This API uses @ref k_spin_lock only when accessing the _kernel.threads\n queue elements. It unlocks it during user callback function processing.\n If a new task is created when this @c foreach function is in progress,\n the added new task would not be included in the enumeration.\n If a task is aborted during this enumeration, there would be a race here\n and there is a possibility that this aborted task would be included in the\n enumeration.\n @note If the task is aborted and the memory occupied by its @c k_thread\n structure is reused when this @c k_thread_foreach_unlocked is in progress\n it might even lead to the system behave unstable.\n This function may never return, as it would follow some @c next task\n pointers treating given pointer as a pointer to the k_thread structure\n while it is something different right now.\n Do not reuse the memory that was occupied by k_thread structure of aborted\n task if it was aborted after this function was called in any context."]
    pub fn k_thread_foreach_unlocked(user_cb: k_thread_user_cb_t, user_data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Dynamically allocate a thread stack.\n\n Relevant stack creation flags include:\n - @ref K_USER allocate a userspace thread (requires `CONFIG_USERSPACE=y`)\n\n @param size Stack size in bytes.\n @param flags Stack creation flags, or 0.\n\n @retval the allocated thread stack on success.\n @retval NULL on failure.\n\n @see CONFIG_DYNAMIC_THREAD"]
    #[link_name = "k_thread_stack_alloc__extern"]
    pub fn k_thread_stack_alloc(size: usize, flags: cty::c_int) -> *mut k_thread_stack_t;
}
extern "C" {
    #[doc = " @brief Free a dynamically allocated thread stack.\n\n @param stack Pointer to the thread stack.\n\n @retval 0 on success.\n @retval -EBUSY if the thread stack is in use.\n @retval -EINVAL if @p stack is invalid.\n @retval -ENOSYS if dynamic thread stack allocation is disabled\n\n @see CONFIG_DYNAMIC_THREAD"]
    #[link_name = "k_thread_stack_free__extern"]
    pub fn k_thread_stack_free(stack: *mut k_thread_stack_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Create a thread.\n\n This routine initializes a thread, then schedules it for execution.\n\n The new thread may be scheduled for immediate execution or a delayed start.\n If the newly spawned thread does not have a delayed start the kernel\n scheduler may preempt the current thread to allow the new thread to\n execute.\n\n Thread options are architecture-specific, and can include K_ESSENTIAL,\n K_FP_REGS, and K_SSE_REGS. Multiple options may be specified by separating\n them using \"|\" (the logical OR operator).\n\n Stack objects passed to this function must be originally defined with\n either of these macros in order to be portable:\n\n - K_THREAD_STACK_DEFINE() - For stacks that may support either user or\n   supervisor threads.\n - K_KERNEL_STACK_DEFINE() - For stacks that may support supervisor\n   threads only. These stacks use less memory if CONFIG_USERSPACE is\n   enabled.\n\n The stack_size parameter has constraints. It must either be:\n\n - The original size value passed to K_THREAD_STACK_DEFINE() or\n   K_KERNEL_STACK_DEFINE()\n - The return value of K_THREAD_STACK_SIZEOF(stack) if the stack was\n   defined with K_THREAD_STACK_DEFINE()\n - The return value of K_KERNEL_STACK_SIZEOF(stack) if the stack was\n   defined with K_KERNEL_STACK_DEFINE().\n\n Using other values, or sizeof(stack) may produce undefined behavior.\n\n @param new_thread Pointer to uninitialized struct k_thread\n @param stack Pointer to the stack space.\n @param stack_size Stack size in bytes.\n @param entry Thread entry function.\n @param p1 1st entry point parameter.\n @param p2 2nd entry point parameter.\n @param p3 3rd entry point parameter.\n @param prio Thread priority.\n @param options Thread options.\n @param delay Scheduling delay, or K_NO_WAIT (for no delay).\n\n @return ID of new thread.\n"]
    #[link_name = "k_thread_create__extern"]
    pub fn k_thread_create(
        new_thread: *mut k_thread,
        stack: *mut k_thread_stack_t,
        stack_size: usize,
        entry: k_thread_entry_t,
        p1: *mut cty::c_void,
        p2: *mut cty::c_void,
        p3: *mut cty::c_void,
        prio: cty::c_int,
        options: u32,
        delay: k_timeout_t,
    ) -> k_tid_t;
}
extern "C" {
    #[doc = " @brief Drop a thread's privileges permanently to user mode\n\n This allows a supervisor thread to be re-used as a user thread.\n This function does not return, but control will transfer to the provided\n entry point as if this was a new user thread.\n\n The implementation ensures that the stack buffer contents are erased.\n Any thread-local storage will be reverted to a pristine state.\n\n Memory domain membership, resource pool assignment, kernel object\n permissions, priority, and thread options are preserved.\n\n A common use of this function is to re-use the main thread as a user thread\n once all supervisor mode-only tasks have been completed.\n\n @param entry Function to start executing from\n @param p1 1st entry point parameter\n @param p2 2nd entry point parameter\n @param p3 3rd entry point parameter"]
    pub fn k_thread_user_mode_enter(
        entry: k_thread_entry_t,
        p1: *mut cty::c_void,
        p2: *mut cty::c_void,
        p3: *mut cty::c_void,
    ) -> !;
}
extern "C" {
    #[doc = " @brief Assign a resource memory pool to a thread\n\n By default, threads have no resource pool assigned unless their parent\n thread has a resource pool, in which case it is inherited. Multiple\n threads may be assigned to the same memory pool.\n\n Changing a thread's resource pool will not migrate allocations from the\n previous pool.\n\n @param thread Target thread to assign a memory pool for resource requests.\n @param heap Heap object to use for resources,\n             or NULL if the thread should no longer have a memory pool."]
    #[link_name = "k_thread_heap_assign__extern"]
    pub fn k_thread_heap_assign(thread: *mut k_thread, heap: *mut k_heap);
}
extern "C" {
    #[doc = " @brief Sleep until a thread exits\n\n The caller will be put to sleep until the target thread exits, either due\n to being aborted, self-exiting, or taking a fatal error. This API returns\n immediately if the thread isn't running.\n\n This API may only be called from ISRs with a K_NO_WAIT timeout,\n where it can be useful as a predicate to detect when a thread has\n aborted.\n\n @param thread Thread to wait to exit\n @param timeout upper bound time to wait for the thread to exit.\n @retval 0 success, target thread has exited or wasn't running\n @retval -EBUSY returned without waiting\n @retval -EAGAIN waiting period timed out\n @retval -EDEADLK target thread is joining on the caller, or target thread\n                  is the caller"]
    #[link_name = "k_thread_join__extern"]
    pub fn k_thread_join(thread: *mut k_thread, timeout: k_timeout_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Put the current thread to sleep.\n\n This routine puts the current thread to sleep for @a duration,\n specified as a k_timeout_t object.\n\n @note if @a timeout is set to K_FOREVER then the thread is suspended.\n\n @param timeout Desired duration of sleep.\n\n @return Zero if the requested time has elapsed or if the thread was woken up\n by the \\ref k_wakeup call, the time left to sleep rounded up to the nearest\n millisecond."]
    #[link_name = "k_sleep__extern"]
    pub fn k_sleep(timeout: k_timeout_t) -> i32;
}
extern "C" {
    #[doc = " @brief Put the current thread to sleep.\n\n This routine puts the current thread to sleep for @a duration milliseconds.\n\n @param ms Number of milliseconds to sleep.\n\n @return Zero if the requested time has elapsed or if the thread was woken up\n by the \\ref k_wakeup call, the time left to sleep rounded up to the nearest\n millisecond."]
    #[link_name = "k_msleep__extern"]
    pub fn k_msleep(ms: i32) -> i32;
}
extern "C" {
    #[doc = " @brief Put the current thread to sleep with microsecond resolution.\n\n This function is unlikely to work as expected without kernel tuning.\n In particular, because the lower bound on the duration of a sleep is\n the duration of a tick, @kconfig{CONFIG_SYS_CLOCK_TICKS_PER_SEC} must be\n adjusted to achieve the resolution desired. The implications of doing\n this must be understood before attempting to use k_usleep(). Use with\n caution.\n\n @param us Number of microseconds to sleep.\n\n @return Zero if the requested time has elapsed or if the thread was woken up\n by the \\ref k_wakeup call, the time left to sleep rounded up to the nearest\n microsecond."]
    #[link_name = "k_usleep__extern"]
    pub fn k_usleep(us: i32) -> i32;
}
extern "C" {
    #[doc = " @brief Cause the current thread to busy wait.\n\n This routine causes the current thread to execute a \"do nothing\" loop for\n @a usec_to_wait microseconds.\n\n @note The clock used for the microsecond-resolution delay here may\n be skewed relative to the clock used for system timeouts like\n k_sleep().  For example k_busy_wait(1000) may take slightly more or\n less time than k_sleep(K_MSEC(1)), with the offset dependent on\n clock tolerances.\n\n @note In case when @kconfig{CONFIG_SYSTEM_CLOCK_SLOPPY_IDLE} and\n @kconfig{CONFIG_PM} options are enabled, this function may not work.\n The timer/clock used for delay processing may be disabled/inactive."]
    #[link_name = "k_busy_wait__extern"]
    pub fn k_busy_wait(usec_to_wait: u32);
}
extern "C" {
    #[doc = " @brief Check whether it is possible to yield in the current context.\n\n This routine checks whether the kernel is in a state where it is possible to\n yield or call blocking API's. It should be used by code that needs to yield\n to perform correctly, but can feasibly be called from contexts where that\n is not possible. For example in the PRE_KERNEL initialization step, or when\n being run from the idle thread.\n\n @return True if it is possible to yield in the current context, false otherwise."]
    pub fn k_can_yield() -> bool;
}
extern "C" {
    #[doc = " @brief Yield the current thread.\n\n This routine causes the current thread to yield execution to another\n thread of the same or higher priority. If there are no other ready threads\n of the same or higher priority, the routine returns immediately."]
    #[link_name = "k_yield__extern"]
    pub fn k_yield();
}
extern "C" {
    #[doc = " @brief Wake up a sleeping thread.\n\n This routine prematurely wakes up @a thread from sleeping.\n\n If @a thread is not currently sleeping, the routine has no effect.\n\n @param thread ID of thread to wake."]
    #[link_name = "k_wakeup__extern"]
    pub fn k_wakeup(thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Query thread ID of the current thread.\n\n This unconditionally queries the kernel via a system call.\n\n @note Use k_current_get() unless absolutely sure this is necessary.\n       This should only be used directly where the thread local\n       variable cannot be used or may contain invalid values\n       if thread local storage (TLS) is enabled. If TLS is not\n       enabled, this is the same as k_current_get().\n\n @return ID of current thread."]
    #[link_name = "k_sched_current_thread_query__extern"]
    pub fn k_sched_current_thread_query() -> k_tid_t;
}
extern "C" {
    #[doc = " @brief Get thread ID of the current thread.\n\n @return ID of current thread.\n"]
    #[link_name = "k_current_get__extern"]
    pub fn k_current_get() -> k_tid_t;
}
extern "C" {
    #[doc = " @brief Abort a thread.\n\n This routine permanently stops execution of @a thread. The thread is taken\n off all kernel queues it is part of (i.e. the ready queue, the timeout\n queue, or a kernel object wait queue). However, any kernel resources the\n thread might currently own (such as mutexes or memory blocks) are not\n released. It is the responsibility of the caller of this routine to ensure\n all necessary cleanup is performed.\n\n After k_thread_abort() returns, the thread is guaranteed not to be\n running or to become runnable anywhere on the system.  Normally\n this is done via blocking the caller (in the same manner as\n k_thread_join()), but in interrupt context on SMP systems the\n implementation is required to spin for threads that are running on\n other CPUs.\n\n @param thread ID of thread to abort."]
    #[link_name = "k_thread_abort__extern"]
    pub fn k_thread_abort(thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Start an inactive thread\n\n If a thread was created with K_FOREVER in the delay parameter, it will\n not be added to the scheduling queue until this function is called\n on it.\n\n @param thread thread to start"]
    #[link_name = "k_thread_start__extern"]
    pub fn k_thread_start(thread: k_tid_t);
}
extern "C" {
    pub fn z_timeout_expires(timeout: *const _timeout) -> k_ticks_t;
}
extern "C" {
    pub fn z_timeout_remaining(timeout: *const _timeout) -> k_ticks_t;
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _static_thread_data {
    pub init_thread: *mut k_thread,
    pub init_stack: *mut k_thread_stack_t,
    pub init_stack_size: cty::c_uint,
    pub init_entry: k_thread_entry_t,
    pub init_p1: *mut cty::c_void,
    pub init_p2: *mut cty::c_void,
    pub init_p3: *mut cty::c_void,
    pub init_prio: cty::c_int,
    pub init_options: u32,
    pub init_name: *const cty::c_char,
    pub init_delay: k_timeout_t,
}
#[test]
fn bindgen_test_layout__static_thread_data() {
    const UNINIT: ::core::mem::MaybeUninit<_static_thread_data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_static_thread_data>(),
        80usize,
        concat!("Size of: ", stringify!(_static_thread_data))
    );
    assert_eq!(
        ::core::mem::align_of::<_static_thread_data>(),
        8usize,
        concat!("Alignment of ", stringify!(_static_thread_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_thread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_thread)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_stack_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_stack_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_entry) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_p1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_p2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_p3) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_p3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_prio) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_prio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_options) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_options)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_name) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_delay) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_static_thread_data),
            "::",
            stringify!(init_delay)
        )
    );
}
extern "C" {
    #[doc = " @brief Get a thread's priority.\n\n This routine gets the priority of @a thread.\n\n @param thread ID of thread whose priority is needed.\n\n @return Priority of @a thread."]
    #[link_name = "k_thread_priority_get__extern"]
    pub fn k_thread_priority_get(thread: k_tid_t) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Set a thread's priority.\n\n This routine immediately changes the priority of @a thread.\n\n Rescheduling can occur immediately depending on the priority @a thread is\n set to:\n\n - If its priority is raised above the priority of the caller of this\n function, and the caller is preemptible, @a thread will be scheduled in.\n\n - If the caller operates on itself, it lowers its priority below that of\n other threads in the system, and the caller is preemptible, the thread of\n highest priority will be scheduled in.\n\n Priority can be assigned in the range of -CONFIG_NUM_COOP_PRIORITIES to\n CONFIG_NUM_PREEMPT_PRIORITIES-1, where -CONFIG_NUM_COOP_PRIORITIES is the\n highest priority.\n\n @param thread ID of thread whose priority is to be set.\n @param prio New priority.\n\n @warning Changing the priority of a thread currently involved in mutex\n priority inheritance may result in undefined behavior."]
    #[link_name = "k_thread_priority_set__extern"]
    pub fn k_thread_priority_set(thread: k_tid_t, prio: cty::c_int);
}
extern "C" {
    #[doc = " @brief Suspend a thread.\n\n This routine prevents the kernel scheduler from making @a thread\n the current thread. All other internal operations on @a thread are\n still performed; for example, kernel objects it is waiting on are\n still handed to it.  Note that any existing timeouts\n (e.g. k_sleep(), or a timeout argument to k_sem_take() et. al.)\n will be canceled.  On resume, the thread will begin running\n immediately and return from the blocked call.\n\n When the target thread is active on another CPU, the caller will block until\n the target thread is halted (suspended or aborted).  But if the caller is in\n an interrupt context, it will spin waiting for that target thread active on\n another CPU to halt.\n\n If @a thread is already suspended, the routine has no effect.\n\n @param thread ID of thread to suspend."]
    #[link_name = "k_thread_suspend__extern"]
    pub fn k_thread_suspend(thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Resume a suspended thread.\n\n This routine allows the kernel scheduler to make @a thread the current\n thread, when it is next eligible for that role.\n\n If @a thread is not currently suspended, the routine has no effect.\n\n @param thread ID of thread to resume."]
    #[link_name = "k_thread_resume__extern"]
    pub fn k_thread_resume(thread: k_tid_t);
}
extern "C" {
    #[doc = " @brief Set time-slicing period and scope.\n\n This routine specifies how the scheduler will perform time slicing of\n preemptible threads.\n\n To enable time slicing, @a slice must be non-zero. The scheduler\n ensures that no thread runs for more than the specified time limit\n before other threads of that priority are given a chance to execute.\n Any thread whose priority is higher than @a prio is exempted, and may\n execute as long as desired without being preempted due to time slicing.\n\n Time slicing only limits the maximum amount of time a thread may continuously\n execute. Once the scheduler selects a thread for execution, there is no\n minimum guaranteed time the thread will execute before threads of greater or\n equal priority are scheduled.\n\n When the current thread is the only one of that priority eligible\n for execution, this routine has no effect; the thread is immediately\n rescheduled after the slice period expires.\n\n To disable timeslicing, set both @a slice and @a prio to zero.\n\n @param slice Maximum time slice length (in milliseconds).\n @param prio Highest thread priority level eligible for time slicing."]
    pub fn k_sched_time_slice_set(slice: i32, prio: cty::c_int);
}
extern "C" {
    #[doc = " @brief Set thread time slice\n\n As for k_sched_time_slice_set, but (when\n CONFIG_TIMESLICE_PER_THREAD=y) sets the timeslice for a specific\n thread.  When non-zero, this timeslice will take precedence over\n the global value.\n\n When such a thread's timeslice expires, the configured callback\n will be called before the thread is removed/re-added to the run\n queue.  This callback will occur in interrupt context, and the\n specified thread is guaranteed to have been preempted by the\n currently-executing ISR.  Such a callback is free to, for example,\n modify the thread priority or slice time for future execution,\n suspend the thread, etc...\n\n @note Unlike the older API, the time slice parameter here is\n specified in ticks, not milliseconds.  Ticks have always been the\n internal unit, and not all platforms have integer conversions\n between the two.\n\n @note Threads with a non-zero slice time set will be timesliced\n always, even if they are higher priority than the maximum timeslice\n priority set via k_sched_time_slice_set().\n\n @note The callback notification for slice expiration happens, as it\n must, while the thread is still \"current\", and thus it happens\n before any registered timeouts at this tick.  This has the somewhat\n confusing side effect that the tick time (c.f. k_uptime_get()) does\n not yet reflect the expired ticks.  Applications wishing to make\n fine-grained timing decisions within this callback should use the\n cycle API, or derived facilities like k_thread_runtime_stats_get().\n\n @param th A valid, initialized thread\n @param slice_ticks Maximum timeslice, in ticks\n @param expired Callback function called on slice expiration\n @param data Parameter for the expiration handler"]
    pub fn k_thread_time_slice_set(
        th: *mut k_thread,
        slice_ticks: i32,
        expired: k_thread_timeslice_fn_t,
        data: *mut cty::c_void,
    );
}
extern "C" {
    #[doc = " @brief Determine if code is running at interrupt level.\n\n This routine allows the caller to customize its actions, depending on\n whether it is a thread or an ISR.\n\n @funcprops \\isr_ok\n\n @return false if invoked by a thread.\n @return true if invoked by an ISR."]
    pub fn k_is_in_isr() -> bool;
}
extern "C" {
    #[doc = " @brief Determine if code is running in a preemptible thread.\n\n This routine allows the caller to customize its actions, depending on\n whether it can be preempted by another thread. The routine returns a 'true'\n value if all of the following conditions are met:\n\n - The code is running in a thread, not at ISR.\n - The thread's priority is in the preemptible range.\n - The thread has not locked the scheduler.\n\n @funcprops \\isr_ok\n\n @return 0 if invoked by an ISR or by a cooperative thread.\n @return Non-zero if invoked by a preemptible thread."]
    #[link_name = "k_is_preempt_thread__extern"]
    pub fn k_is_preempt_thread() -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Test whether startup is in the before-main-task phase.\n\n This routine allows the caller to customize its actions, depending on\n whether it being invoked before the kernel is fully active.\n\n @funcprops \\isr_ok\n\n @return true if invoked before post-kernel initialization\n @return false if invoked during/after post-kernel initialization"]
    #[link_name = "k_is_pre_kernel__extern"]
    pub fn k_is_pre_kernel() -> bool;
}
extern "C" {
    #[doc = " @brief Lock the scheduler.\n\n This routine prevents the current thread from being preempted by another\n thread by instructing the scheduler to treat it as a cooperative thread.\n If the thread subsequently performs an operation that makes it unready,\n it will be context switched out in the normal manner. When the thread\n again becomes the current thread, its non-preemptible status is maintained.\n\n This routine can be called recursively.\n\n Owing to clever implementation details, scheduler locks are\n extremely fast for non-userspace threads (just one byte\n inc/decrement in the thread struct).\n\n @note This works by elevating the thread priority temporarily to a\n cooperative priority, allowing cheap synchronization vs. other\n preemptible or cooperative threads running on the current CPU.  It\n does not prevent preemption or asynchrony of other types.  It does\n not prevent threads from running on other CPUs when CONFIG_SMP=y.\n It does not prevent interrupts from happening, nor does it prevent\n threads with MetaIRQ priorities from preempting the current thread.\n In general this is a historical API not well-suited to modern\n applications, use with care."]
    pub fn k_sched_lock();
}
extern "C" {
    #[doc = " @brief Unlock the scheduler.\n\n This routine reverses the effect of a previous call to k_sched_lock().\n A thread must call the routine once for each time it called k_sched_lock()\n before the thread becomes preemptible."]
    pub fn k_sched_unlock();
}
extern "C" {
    #[doc = " @brief Set current thread's custom data.\n\n This routine sets the custom data for the current thread to @ value.\n\n Custom data is not used by the kernel itself, and is freely available\n for a thread to use as it sees fit. It can be used as a framework\n upon which to build thread-local storage.\n\n @param value New custom data value.\n"]
    #[link_name = "k_thread_custom_data_set__extern"]
    pub fn k_thread_custom_data_set(value: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Get current thread's custom data.\n\n This routine returns the custom data for the current thread.\n\n @return Current custom data value."]
    #[link_name = "k_thread_custom_data_get__extern"]
    pub fn k_thread_custom_data_get() -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Set current thread name\n\n Set the name of the thread to be used when @kconfig{CONFIG_THREAD_MONITOR}\n is enabled for tracing and debugging.\n\n @param thread Thread to set name, or NULL to set the current thread\n @param str Name string\n @retval 0 on success\n @retval -EFAULT Memory access error with supplied string\n @retval -ENOSYS Thread name configuration option not enabled\n @retval -EINVAL Thread name too long"]
    #[link_name = "k_thread_name_set__extern"]
    pub fn k_thread_name_set(thread: k_tid_t, str_: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Get thread name\n\n Get the name of a thread\n\n @param thread Thread ID\n @retval Thread name, or NULL if configuration not enabled"]
    pub fn k_thread_name_get(thread: k_tid_t) -> *const cty::c_char;
}
extern "C" {
    #[doc = " @brief Copy the thread name into a supplied buffer\n\n @param thread Thread to obtain name information\n @param buf Destination buffer\n @param size Destination buffer size\n @retval -ENOSPC Destination buffer too small\n @retval -EFAULT Memory access error\n @retval -ENOSYS Thread name feature not enabled\n @retval 0 Success"]
    #[link_name = "k_thread_name_copy__extern"]
    pub fn k_thread_name_copy(thread: k_tid_t, buf: *mut cty::c_char, size: usize) -> cty::c_int;
}
extern "C" {
    #[doc = " @brief Get thread state string\n\n This routine generates a human friendly string containing the thread's\n state, and copies as much of it as possible into @a buf.\n\n @param thread_id Thread ID\n @param buf Buffer into which to copy state strings\n @param buf_size Size of the buffer\n\n @retval Pointer to @a buf if data was copied, else a pointer to \"\"."]
    pub fn k_thread_state_str(
        thread_id: k_tid_t,
        buf: *mut cty::c_char,
        buf_size: usize,
    ) -> *const cty::c_char;
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_timer {
    pub timeout: _timeout,
    pub wait_q: _wait_q_t,
    pub expiry_fn: ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>,
    pub stop_fn: ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>,
    pub period: k_timeout_t,
    pub status: u32,
    pub user_data: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_k_timer() {
    const UNINIT: ::core::mem::MaybeUninit<k_timer> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_timer>(),
        80usize,
        concat!("Size of: ", stringify!(k_timer))
    );
    assert_eq!(
        ::core::mem::align_of::<k_timer>(),
        8usize,
        concat!("Alignment of ", stringify!(k_timer))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wait_q) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(wait_q)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expiry_fn) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(expiry_fn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stop_fn) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(stop_fn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).period) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(period)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(k_timer),
            "::",
            stringify!(user_data)
        )
    );
}
#[doc = " @typedef k_timer_expiry_t\n @brief Timer expiry function type.\n\n A timer's expiry function is executed by the system clock interrupt handler\n each time the timer expires. The expiry function is optional, and is only\n invoked if the timer has been initialized with one.\n\n @param timer     Address of timer."]
pub type k_timer_expiry_t = ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>;
#[doc = " @typedef k_timer_stop_t\n @brief Timer stop function type.\n\n A timer's stop function is executed if the timer is stopped prematurely.\n The function runs in the context of call that stops the timer.  As\n k_timer_stop() can be invoked from an ISR, the stop function must be\n callable from interrupt context (isr-ok).\n\n The stop function is optional, and is only invoked if the timer has been\n initialized with one.\n\n @param timer     Address of timer."]
pub type k_timer_stop_t = ::core::option::Option<unsafe extern "C" fn(timer: *mut k_timer)>;
extern "C" {
    #[doc = " @brief Initialize a timer.\n\n This routine initializes a timer, prior to its first use.\n\n @param timer     Address of timer.\n @param expiry_fn Function to invoke each time the timer expires.\n @param stop_fn   Function to invoke if the timer is stopped while running."]
    pub fn k_timer_init(timer: *mut k_timer, expiry_fn: k_timer_expiry_t, stop_fn: k_timer_stop_t);
}
extern "C" {
    #[doc = " @brief Start a timer.\n\n This routine starts a timer, and resets its status to zero. The timer\n begins counting down using the specified duration and period values.\n\n Attempting to start a timer that is already running is permitted.\n The timer's status is reset to zero and the timer begins counting down\n using the new duration and period values.\n\n @param timer     Address of timer.\n @param duration  Initial timer duration.\n @param period    Timer period."]
    #[link_name = "k_timer_start__extern"]
    pub fn k_timer_start(timer: *mut k_timer, duration: k_timeout_t, period: k_timeout_t);
}
extern "C" {
    #[doc = " @brief Stop a timer.\n\n This routine stops a running timer prematurely. The timer's stop function,\n if one exists, is invoked by the caller.\n\n Attempting to stop a timer that is not running is permitted, but has no\n effect on the timer.\n\n @note The stop handler has to be callable from ISRs if @a k_timer_stop is to\n be called from ISRs.\n\n @funcprops \\isr_ok\n\n @param timer     Address of timer."]
    #[link_name = "k_timer_stop__extern"]
    pub fn k_timer_stop(timer: *mut k_timer);
}
extern "C" {
    #[doc = " @brief Read timer status.\n\n This routine reads the timer's status, which indicates the number of times\n it has expired since its status was last read.\n\n Calling this routine resets the timer's status to zero.\n\n @param timer     Address of timer.\n\n @return Timer status."]
    #[link_name = "k_timer_status_get__extern"]
    pub fn k_timer_status_get(timer: *mut k_timer) -> u32;
}
extern "C" {
    #[doc = " @brief Synchronize thread to timer expiration.\n\n This routine blocks the calling thread until the timer's status is non-zero\n (indicating that it has expired at least once since it was last examined)\n or the timer is stopped. If the timer status is already non-zero,\n or the timer is already stopped, the caller continues without waiting.\n\n Calling this routine resets the timer's status to zero.\n\n This routine must not be used by interrupt handlers, since they are not\n allowed to block.\n\n @param timer     Address of timer.\n\n @return Timer status."]
    #[link_name = "k_timer_status_sync__extern"]
    pub fn k_timer_status_sync(timer: *mut k_timer) -> u32;
}
extern "C" {
    #[doc = " @brief Associate user-specific data with a timer.\n\n This routine records the @a user_data with the @a timer, to be retrieved\n later.\n\n It can be used e.g. in a timer handler shared across multiple subsystems to\n retrieve data specific to the subsystem this timer is associated with.\n\n @param timer     Address of timer.\n @param user_data User data to associate with the timer."]
    #[link_name = "k_timer_user_data_set__extern"]
    pub fn k_timer_user_data_set(timer: *mut k_timer, user_data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @internal"]
    #[link_name = "z_impl_k_timer_user_data_set__extern"]
    pub fn z_impl_k_timer_user_data_set(timer: *mut k_timer, user_data: *mut cty::c_void);
}
extern "C" {
    #[doc = " @brief Retrieve the user-specific data from a timer.\n\n @param timer     Address of timer.\n\n @return The user data."]
    #[link_name = "k_timer_user_data_get__extern"]
    pub fn k_timer_user_data_get(timer: *const k_timer) -> *mut cty::c_void;
}
extern "C" {
    #[link_name = "z_impl_k_timer_user_data_get__extern"]
    pub fn z_impl_k_timer_user_data_get(timer: *const k_timer) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " @brief Get system uptime, in system ticks.\n\n This routine returns the elapsed time since the system booted, in\n ticks (c.f. @kconfig{CONFIG_SYS_CLOCK_TICKS_PER_SEC}), which is the\n fundamental unit of resolution of kernel timekeeping.\n\n @return Current uptime in ticks."]
    #[link_name = "k_uptime_ticks__extern"]
    pub fn k_uptime_ticks() -> i64;
}
extern "C" {
    #[doc = " @brief Get system uptime.\n\n This routine returns the elapsed time since the system booted,\n in milliseconds.\n\n @note\n    While this function returns time in milliseconds, it does\n    not mean it has millisecond resolution. The actual resolution depends on\n    @kconfig{CONFIG_SYS_CLOCK_TICKS_PER_SEC} config option.\n\n @return Current uptime in milliseconds."]
    #[link_name = "k_uptime_get__extern"]
    pub fn k_uptime_get() -> i64;
}
extern "C" {
    #[doc = " @brief Get system uptime (32-bit version).\n\n This routine returns the lower 32 bits of the system uptime in\n milliseconds.\n\n Because correct conversion requires full precision of the system\n clock there is no benefit to using this over k_uptime_get() unless\n you know the application will never run long enough for the system\n clock to approach 2^32 ticks.  Calls to this function may involve\n interrupt blocking and 64-bit math.\n\n @note\n    While this function returns time in milliseconds, it does\n    not mean it has millisecond resolution. The actual resolution depends on\n    @kconfig{CONFIG_SYS_CLOCK_TICKS_PER_SEC} config option\n\n @return The low 32 bits of the current uptime, in milliseconds."]
    #[link_name = "k_uptime_get_32__extern"]
    pub fn k_uptime_get_32() -> u32;
}
extern "C" {
    #[doc = " @brief Get elapsed time.\n\n This routine computes the elapsed time between the current system uptime\n and an earlier reference time, in milliseconds.\n\n @param reftime Pointer to a reference time, which is updated to the current\n                uptime upon return.\n\n @return Elapsed time."]
    #[link_name = "k_uptime_delta__extern"]
    pub fn k_uptime_delta(reftime: *mut i64) -> i64;
}
extern "C" {
    #[doc = " @brief Read the hardware clock.\n\n This routine returns the current time, as measured by the system's hardware\n clock.\n\n @return Current hardware clock up-counter (in cycles)."]
    #[link_name = "k_cycle_get_32__extern"]
    pub fn k_cycle_get_32() -> u32;
}
extern "C" {
    #[doc = " @brief Read the 64-bit hardware clock.\n\n This routine returns the current time in 64-bits, as measured by the\n system's hardware clock, if available.\n\n @see CONFIG_TIMER_HAS_64BIT_CYCLE_COUNTER\n\n @return Current hardware clock up-counter (in cycles)."]
    #[link_name = "k_cycle_get_64__extern"]
    pub fn k_cycle_get_64() -> u64;
}
#[doc = " @}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_queue {
    pub data_q: sys_sflist_t,
    pub lock: k_spinlock,
    pub wait_q: _wait_q_t,
}
#[test]
fn bindgen_test_layout_k_queue() {
    const UNINIT: ::core::mem::MaybeUninit<k_queue> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_queue>(),
        32usize,
        concat!("Size of: ", stringify!(k_queue))
    );
    assert_eq!(
        ::core::mem::align_of::<k_queue>(),
        8usize,
        concat!("Alignment of ", stringify!(k_queue))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_q) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_queue),
            "::",
            stringify!(data_q)
        )
    );
    assert_eq!(
